post_1201 = (

    {'mkb_key': 'B00.0__B00.1__B00.2__B00.7__B00.8__B00.9',
     'Наименование заболевания': 'B00.0–В00.2, В00.7–В00.9 Инфекции, вызванные вирусом герпеса (рецидивирующее течение инфекции (5 и более раз в год) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-инфекционист – по медицинским показаниям. ОАК – 2 раза в год. БАК (АЛТ, ACT), ОАМ, иммунограмма, ИФА ВИЧ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет. При отсутствии рецидивов более 5 раз в год в течение 2 лет – снятие с учета '},

    {'mkb_key': 'B27.0__B27.1__B27.2__B27.3__B27.4__B27.5__B27.6__B27.7__B27.8__B27.9',
     'Наименование заболевания': 'B27.0–В27.9 Инфекционный мононуклеоз (реконвалесценты) ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – через 1, 3 и 6 месяцев в первое полугодие после выздоровления. ОАК, БАК (АЛТ, ACT, билирубин, тимоловая проба) – перед каждым медицинским осмотром. При сохранении признаков активности инфекции – ИФА крови – a/VCA IgM, a/EBV-EA IgG; исследование крови на ВЭБ методом ПЦР; иммунограмма, ИФА ВИЧ – по медицинским показаниям; УЗИ ОБП – через 6 месяцев (по показаниям чаще) ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев '},

    {'mkb_key': 'B27.0__B27.1__B27.2__B27.3__B27.4__B27.5__B27.6__B27.7__B27.8__B27.9',
     'Наименование заболевания': 'B27.0–В27.9 Инфекционный мононуклеоз (хроническое течение) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-инфекционист – по медицинским показаниям. ОАК, БАК (АЛТ, ACT, билирубин, тимоловая проба) – 2 раза в год. По медицинским показаниям – a/VCA IgM, a/EBV-EA IgG, исследование крови на ВЭБ методом ПЦР, иммунограмма. УЗИ ОБП – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета при стойкой клинико-лабораторной ремиссии в течение 2 лет '},

    {'mkb_key': 'A.38',
     'Наименование заболевания': 'A.38 Скарлатина ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – через 3 недели после выздоровления. Врач-кардиолог, врач-нефролог, врач-оториноларинголог – по медицинским показаниям. ОАК, ОАМ, ЭКГ, БАК (АСЛ-О) – через 3 недели после выздоровления ',
     'Сроки наблюдения за пациентом': 'В течение 1 месяца. При отсутствии клинико-лабораторных изменений – снятие с учета '},

    {'mkb_key': 'B26.0__B26.1__B26.2__B26.3__B26.4__B26.5__B26.6__B26.7__B26.8__B26.9',
     'Наименование заболевания': 'B26.0–В26.9 Эпидемический паротит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. ОАК, БАК (амилаза крови) – 2 раза в первые 6 месяцев после выздоровления, далее – 1 раз в 6 месяцев. УЗИ ОБП – 1 раз через 3 месяца, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'B26.3',
     'Наименование заболевания': 'B26.3 Паротитный панкреатит ',
     'Сроки и кратность медицинских обследований': 'Врач-гастроэнтеролог – по медицинским показаниям. УЗИ ОБП – 1 раз через 3 месяца, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'B26.0',
     'Наименование заболевания': 'B26.0 Паротитный орхит (оофорит) ',
     'Сроки и кратность медицинских обследований': 'Врач-уролог (врач – акушер-гинеколог) – 2 раза в год. Врач – детский хирург (врач-хирург), врач-эндокринолог – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'A36.0__A36.1__A36.2__A36.3__A36.4__A36.5__A36.6__A36.7__A36.8__A36.9',
     'Наименование заболевания': 'A36 Дифтерия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – через 1 и 3 месяца после выписки, далее – 3 раза в год. Врач-кардиолог – через 1 месяц после выписки, далее – по медицинским показаниям. ОАК, ОАМ, ЭКГ – перед каждым медицинским осмотром. БАК – по показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'A36.0__A36.1__A36.2__A36.3__A36.4__A36.5__A36.6__A36.7__A36.8__A36.9',
     'Наименование заболевания': 'Субтоксическая и токсическая дифтерия зева I ст.  ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог, врач-нефролог, врач-оториноларинголог – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'A36.0__A36.1__A36.2__A36.3__A36.4__A36.5__A36.6__A36.7__A36.8__A36.9',
     'Наименование заболевания': 'Токсическая дифтерия зева II–III ст. ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог, врач-нефролог, врач-оториноларинголог – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'B58.0__B58.1__B58.2__B58.3__B58.4__B58.5__B58.6__B58.7__B58.8__B58.9',
     'Наименование заболевания': 'B58 Токсоплазмоз ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – в течение первого года – 4 раза в год, далее – 2 раза в год. При поражении глаз – врач-офтальмолог – 1 раз в 3 месяца 1-й год, 1 раз в 6 месяцев – 2-й год, далее при отсутствии обострения – 1 раз в год. Врач-невролог, врач-кардиолог – по медицинским показаниям. ОАК – перед каждым медицинским осмотром, БАК (АЛТ, КФК, КФК-МФ), ЭКГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 10 лет. При поражении глаз – до 18 лет. Снятие с учета при отсутствии клинико-лабораторных изменений '},

    {'mkb_key': 'Р37.1',
     'Наименование заболевания': 'Р37.1 Врожденный токсоплазмоз ',
     'Сроки и кратность медицинских обследований': 'В возрасте до 1 года – врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в месяц, другие врачи-специалисты (врач-офтальмолог, врач-невролог) – по медицинским показаниям. При поражении глаз – врач-офтальмолог – 1 раз в 3 месяца 1-й год, 1 раз в 6 месяцев – 2-й год, далее при отсутствии обострения – 1 раз в год; ОАК – перед каждым медицинским осмотром, БАК (АЛТ, КФК, КФК-МФ); иммунограмма, ЭКГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'A03.0__A03.1__A03.2__A03.3__A03.4__A03.5__A03.6__A03.7__A03.8__A03.9',
     'Наименование заболевания': 'A03 Шигеллез ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в месяц. Копрограмма – перед каждым медицинским осмотром. ОАК, ОАМ, бактериологическое исследование кала на ПКФ – перед снятием с учета ',
     'Сроки наблюдения за пациентом': 'При остром течении – в течение 1 месяца, при получении положительного результата бактериологических исследований, проведенных после повторного курса лечения или в период наблюдения, срок наблюдения продлевается до 3 месяцев с проведением по истечении каждого месяца двукратных бактериологических исследований кала '},

    {'mkb_key': 'A02.0__А02.1__А02.2__А02.3__А02.4__А02.5__А02.6__А02.7__А02.8__А02.9',
     'Наименование заболевания': 'A02 Другие сальмонеллезные инфекции ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в месяц. ОАК, ОАМ, бактериологическое исследование ',
     'Сроки наблюдения за пациентом': 'В течение 1 месяца '},

    {'mkb_key': 'A04.0__А04.1__А04.2__А04.3__А04.4__А04.5__А04.6__А04.7__А04.8__А04.9',
     'Наименование заболевания': 'A04 Другие бактериальные кишечные инфекции ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в месяц. ОАК, ОАМ, бактериологическое исследование ',
     'Сроки наблюдения за пациентом': 'При остром течении – в течение 1 месяца '},

    {'mkb_key': 'A28.2',
     'Наименование заболевания': 'A28.2 Экстраинтестинальный иерсиниоз ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в первые 6 месяцев. ОАК – перед каждым медицинским осмотром. БАК (АЛТ, ACT, билирубин, тимоловая проба), ЭКГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев. При отсутствии клинико-лабораторных изменений – снятие с учета '},

    {'mkb_key': 'B15.0__B15.1__B15.2__B15.3__B15.4__B15.5__B15.6__B15.7__B15.8__B15.9',
     'Наименование заболевания': 'B15.0–В15.9 Острый гепатит А ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – через 10 дней, 1, 3, 6 месяцев после выписки из стационара. При повышенном уровне билирубина и (или) АЛТ через 6 месяцев – направление к врачу-инфекционисту областного уровня (для г. Минска – диспансерный кабинет учреждения здравоохранения «Городская детская инфекционная клиническая больница» (далее – УЗ «ГДИКБ»). ОАК, ОАМ. БАК (АЛТ, билирубин, ACT, общий белок), протеинограмма – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев после выписки из стационара. При наличии остаточных явлений – наблюдение до полного выздоровления. При отсутствии клинико-лабораторных изменений – снятие с учета '},

    {'mkb_key': 'B16.0__B16.1__B16.2__B16.3__B16.4__B16.5__B16.6__B16.7__B16.8__B16.9',
     'Наименование заболевания': 'B16.0–В16.9 Острый гепатит В ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – через 10 дней, 1, 3, 6, 9, 12 месяцев, при сохранении HBsAg, повышении АЛТ и (или) билирубина через 3 месяца – врач-инфекционист областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ»). БАК (общий билирубин, АЛТ, ACT, ГГТП) – перед каждым медицинским осмотром. ОАК, ОАМ – по медицинским показаниям. Определение HBsAg – через 3, 6, 9, 12 месяцев. HBeAg, anti-HBs, ДНК ВГВ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 12 месяцев после выписки из стационара при нормальных показателях БАК и отсутствии признаков хронизации (отрицательный HBsAg) '},

    {'mkb_key': 'B17.1',
     'Наименование заболевания': 'B17.1 Другие острые вирусные гепатиты. Острый гепатит С ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – через 10 дней, 1, 3, 6, 9, 12 месяцев, при сохранении РНК ВГС, повышении АЛТ и (или) билирубина через 3 месяца – врач-инфекционист областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ»). Через 10 дней, 1, 3, 6, 9, 12 месяцев – осмотр, БАК (общий билирубин, АЛТ, ACT, ГГТП). Пациентам с безжелтушной формой через 1 месяц – ПЦР РНК ВГС в качественной реакции. Пациентам с желтушной формой через 3 месяца ПЦР РНК ВГС (качественный анализ). При положительной реакции – консультация врача-инфекциониста областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ»). Анти-HCV, ПЦР РНК ВГС (качественный анализ) – через 1 год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета через 12 месяцев после выписки из стационара '},

    {'mkb_key': 'B18.0__B18.1__B18.8__B18.9',
     'Наименование заболевания': 'B18.0–В18.1, В18.8–В18.9 Хронический вирусный гепатит ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год, врач-инфекционист областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ») – 1 раз в год. ОАК – 2 раза в год. БАК (билирубин, АЛТ, ACT, общий белок) – 2 раза в год. УЗИ ОБП – 1 раз в год. Эластометрия печени – по показаниям. HBeAg, анти-НВе, ДНК ВГВ – 1 раз в год (при хроническом гепатите В). По медицинским показаниям – анти-HDV, альфа-фетопротеин ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'B18.2',
     'Наименование заболевания': 'B18.2 Хронический вирусный гепатит С ',
     'Сроки и кратность медицинских обследований': 'Врач-инфекционист (врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год, врач-инфекционист областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ») – 1 раз в год. ОАК – 2 раза в год. БАК (билирубин, АЛТ, ACT, общий белок) – 2 раза в год. УЗИ ОБП – 1 раз в год. Эластометрия печени – по показаниям. По медицинским показаниям – ПЦР РНК ВГС качественная и количественная. При проведении этиотропного лечения: ОАК, БАК (АЛТ, ACT, общий билирубин, ГГТП, мочевина, креатинин, глюкоза, ЩФ), МНО – через 4, 8, 12 недель после начала терапии. ПЦР РНК ВГС (качественная), при положительном результате – количественная через 4 и 12 недель после начала терапии; через 12, 24, 48 недель после отмены ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'B34.2',
     'Наименование заболевания': 'B34.2 Короновирусная инфекция (COVID-19) Пневмония ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – через 1, 3 и 6 месяцев после выздоровления. Врач-инфекционист, врач-кардиоревматолог – по медицинским показаниям. ОАК, БАК (АЛТ, КФК, КФК-МФ, ACT, мочевина, креатинин) – через 1, 3 и 6 месяцев после выздоровления; коагулограмма (волчаночный антикоагулянт), ЭКГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев после выздоровления '},

    {'mkb_key': '',
     'Наименование заболевания': 'B 34.2 Мультисистемный воспалительный синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики), врач-кардиоревматолог – через 1, 3 и 6 месяцев после выздоровления. Врач-инфекционист – по медицинским показаниям. ОАК – 1 раз в 10 дней – 1-й месяц, затем через 3, 6 месяцев после выздоровления; БАК (АЛТ, КФК, КФК-МФ, ACT, мочевина, креатинин) – через 1 месяц после выздоровления; ЭКГ, УЗИ сердца – через 1 месяц после выздоровления, затем – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев после выздоровления '},

    {'mkb_key': 'C22.0__C22.1__C22.2__C22.3__C22.4__C22.5__C22.6__C22.7__C22.8__C22.9',
     'Наименование заболевания': 'C22 Злокачественное новообразование печени ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК, определение уровня АФП, УЗИ ОБП – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. КТ зоны интереса, ЭКГ – 1 раз в 6 месяцев (первые 2 года наблюдения), далее – 1 раз в год. ЭХО-КГ – 1 раз в 3 года ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C40.0__C40.1__C40.2__C40.3__C40.4__C40.5__C40.6__C40.7__C40.8__C40.9__C41.0__C41.1__C41.2__C41.3__C41.4__C41.5__C41.6__C41.7__C41.8__C41.9',
     'Наименование заболевания': 'C40–С41 Остеогенная саркома, Саркома Юинга ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. УЗИ ОБП – 1 раз в год. КТ зоны интереса, рентгенография/КТ органов грудной клетки, ЭКГ – 1 раз в 6 месяцев (первые 2 года наблюдения), далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C45.0__C45.1__C45.2__C45.3__C45.4__C45.5__C45.6__C45.7__C45.8__C45.9__C46.0__C46.1__C46.2__C46.3__C46.4__C46.5__C46.6__C46.7__C46.8__C46.9__C47.0__C47.1__C47.2__C47.3__C47.4__C47.5__C47.6__C47.7__C47.8__C47.9__C48.0__C48.1__C48.2__C48.3__C48.4__C48.5__C48.6__C48.7__C48.8__C48.9__C49.0__C49.1__C49.2__C49.3__C49.4__C49.5__C49.6__C49.7__C49.8__C49.9',
     'Наименование заболевания': 'C45–С49 Рабдомиосаркома ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК, УЗИ ОБП – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. КТ зоны интереса, ЭКГ – 1 раз в 6 месяцев (первые 2 года наблюдения), далее – 1 раз в год. ЭХО-КГ – 1 раз в 3 года (пациенты, получавшие антрациклины, лучевую терапию на область грудной клетки). Рентгенография/КТ органов грудной клетки – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C47.0__C47.1__C47.2__C47.3__C47.4__C47.5__C47.6__C47.7__C47.8__C47.9',
     'Наименование заболевания': 'C47 Нейробластома Ганглионейробластома ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. Врач – детский невролог, врач – детский эндокринолог – 1 раз в год. ОАК, БАК, УЗИ ОБП, определение уровня нейронспецифической энолазы. В группе пациентов высокого риска – определение уровня биогенных аминов в моче (ГВК, ВМК) – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. Исследование уровня гормонов щитовидной железы (при МИБГ-терапии) – 1 раз в 6 месяцев (первые 2 года наблюдения), далее – 1 раз в год. Цитологическое исследование препарата костного мозга (при инициальном поражении костного мозга и после ТГСК) – 1 раз в 6 месяцев (первые 2 года наблюдения), 1 раз в год (3–5-е годы наблюдения). Рентгенография органов грудной клетки – 1 раз в 6 месяцев (первые 2 года наблюдения), далее – 1 раз в год. ЭКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C56.0__C56.1__C56.2__C56.3__C56.4__C56.5__C56.6__C56.7__C56.8__C56.9__C62.0__C62.1__C62.2__C62.3__C62.4__C62.5__C62.6__C62.7__C62.8__C62.9',
     'Наименование заболевания': 'C56 Злокачественное новообразование яичника С62 Злокачественное новообразование яичка ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог, врач – детский невролог, врач – детский эндокринолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК, определение уровня АФП и ХГТ, УЗИ ОБП и первичного опухолевого очага – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. Определение уровня половых гормонов – 1 раз в 6 месяцев (1–2-е годы наблюдения), далее – 1 раз в год. КТ зоны интереса – 1 раз в 6 месяцев (1-й год наблюдения), 1 раз в год (2–5-е годы наблюдения) ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C64.0__C64.1__C64.2__C64.3__C64.4__C64.5__C64.6__C64.7__C64.8__C64.9',
     'Наименование заболевания': 'C64 Злокачественное новообразование почки ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК, ОАМ, УЗИ ОБП – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. КТ зоны интереса – 1 раз в 6 месяцев (1–2-е годы наблюдения), далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C71.0__C71.1__C71.2__C71.3__C71.4__C71.5__C71.6__C71.7__C71.8__C71.9',
     'Наименование заболевания': 'C71 Злокачественное новообразование головного мозга ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог, врач – детский невролог, врач-офтальмолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. МРТ головного мозга с контрастным усилением – 1 раз в 3 месяца (1–2-е годы наблюдения), 2 раза в год (3–4-е годы наблюдения), 1 раз в год (5-й год наблюдения) ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C81.0__C81.1__C81.2__C81.3__C81.4__C81.5__C81.6__C81.7__C81.8__C81.9',
     'Наименование заболевания': 'C81 Лимфома Ходжкина (лимфогранулематоз) ',
     'Сроки и кратность медицинских обследований': 'Врач-онколог, врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. ОАК, БАК, УЗИ ОБП, лимфатических узлов – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–3-е годы наблюдения), далее – 1 раз в год. Определения уровня гормонов щитовидной железы, УЗИ щитовидной железы после лучевой терапии на область шеи, ЭКГ – 1 раз в год. ЭХО-КГ – 1 раз в 3 года. КТ зоны интереса – 2 раза в год (1–2-е годы наблюдения), 1 раз в год (3–5-е годы наблюдения) ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-онколога '},

    {'mkb_key': 'C91.0',
     'Наименование заболевания': 'C91.0 Острый лимфобластный лейкоз ',
     'Сроки и кратность медицинских обследований': 'Врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения); 1 раз в 6 месяцев (2-й и 3-й годы наблюдения), далее – 1 раз в год. Консультация других врачей-специалистов – по показаниям. ОАК, БАК – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2-й и 3-й годы наблюдения), далее – 1 раз в год. УЗИ ОБП, ЭКГ – 1 раз в год. ЭХО-КГ – 1 раз в 3 года ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'C92.0',
     'Наименование заболевания': 'C92.0 Острый миелобластный лейкоз ',
     'Сроки и кратность медицинских обследований': 'Врач – детский онколог-гематолог – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–4-е годы), далее – 1 раз в год. ОАК, ОАМ, БАК – 1 раз в 3 месяца (1-й год наблюдения), 1 раз в 6 месяцев (2–4-е годы), далее – 1 раз в год. УЗИ ОБП, ЭКГ – 1 раз в год. ЭХО-КГ – 1 раз в 3 года ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'C92.1',
     'Наименование заболевания': 'C92.1 Хронический миелоидный лейкоз ',
     'Сроки и кратность медицинских обследований': '1-й месяц терапии ингибиторами тирозинкиназы (далее – ИТК): врач – детский онколог-гематолог – 1 раз в неделю; 2–3-й месяцы терапии ИТК: врач – детский онколог-гематолог – 1 раз в месяц; 4–24-й месяцы терапии ИТК: врач – детский онколог-гематолог – 1 раз в 3 месяца. Далее при продолжающейся терапии ИТК, достигнутом уровне минимальной остаточной болезни (уровень экспрессии BCR/ABL1 методом ПЦР в реальном времени) &lt;0,01 % – не реже 1 раза в 6 месяцев. 1-й месяц терапии ИТК: ОАК, БАК – 1 раз в неделю; ОАМ – 1 раз в 2 недели. 2–3-й месяцы терапии ИТК: ОАК, БАК – 1 раз в месяц. Молекулярно-биологическое исследование (уровень экспрессии BCR/ABL1 методом ПЦР в реальном времени) периферической крови – 1 раз в месяц. 4–24-й месяцы терапии ИТК: ОАК, БАК – 1 раз в 3 месяца. Молекулярно-биологическое исследование (уровень экспрессии BCR/ABL1 методом ПЦР в реальном времени) периферической крови – 1 раз в 3 месяца. При уровне экспрессии гена BCR/ABL1 &lt;0,01 % дальнейший молекулярный мониторинг – 1 раз в 6 месяцев. После достижения полной цитогенетической ремиссии цитогенетическое исследование костного мозга проводится 1 раз в год и при подозрении на цитогенетический рецидив. УЗИ ОБП, ЭХО-КГ, ЭКГ – 1 раз в год. Исследование уровня гормонов в сыворотке, УЗИ щитовидной железы, органов малого таза – 1 раз в 2 года. Денситометрия – при длительности терапии ИТК более 5 лет ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. При достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'D50.0__D50.1__D50.2__D50.3__D50.4__D50.5__D50.6__D50.7__D50.8__D50.9',
     'Наименование заболевания': 'D50 Железодефицитная анемия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 1 раз в год (при тяжелой анемии и в случаях резистентности к лечению лекарственными средствами на основе железа). Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 1 раз в 2–4 недели до нормализации уровня гемоглобина, далее – 4 раза в год. БАК (общий белок, сывороточное железо, ОЖСС, ферритин) – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета через 1 год от даты нормализации ОАК '},

    {'mkb_key': 'D51.0',
     'Наименование заболевания': 'D51.0 Витамин В12-дефицитная анемия вследствие дефицита внутреннего фактора ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 1 раз в 2 недели до нормализации уровня гемоглобина, далее – 2 раза в год. БАК (билирубин и его фракции, общий белок, ЩФ, АЛТ, ACT, ЛДГ, амилаза, сывороточное железо, ферритин) – 1 раз в год. Уровень витамина B12 в сыворотке крови – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'В течение 3 лет. Снятие с учета при отсутствии рецидива в течение 3 лет '},

    {'mkb_key': 'D52.0__D52.1__D52.2__D52.3__D52.4__D52.5__D52.6__D52.7__D52.8__D52.9',
     'Наименование заболевания': 'D52 Фолиеводефицитная анемия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 1 раз в год (при тяжелой форме, в случаях неэффективности проводимой терапии). Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 1 раз в 2 недели до нормализации уровня гемоглобина, далее – 2 раза з год. БАК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета через 1 год от даты нормализации ОАК '},

    {'mkb_key': 'D53.0__D53.1__D53.2__D53.3__D53.4__D53.5__D53.6__D53.7__D53.8__D53.9',
     'Наименование заболевания': 'D53 Другие анемии, связанные с питанием ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гастроэнтеролог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 1 раз в 2 недели до нормализации уровня гемоглобина, далее – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'В течение 1 года. Снятие с учета через 1 год от даты нормализации ОАК '},

    {'mkb_key': 'D55.0__D55.1__D55.2__D55.3__D55.4__D55.5__D55.6__D55.7__D55.8__D55.9',
     'Наименование заболевания': 'D55 Анемия вследствие ферментных нарушений ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом числа ретикулоцитов и ретикулоцитарного индекса – 2 раза в год. БАК (билирубин и его фракции, гемоглобин плазмы, гаптоглобин, ACT, АЛТ, ЛДГ, ГГТ, ЩФ) – 2 раза в год. ОАМ, УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. По достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'D56.0__D56.1__D56.2__D56.3__D56.4__D56.5__D56.6__D56.7__D56.8__D56.9',
     'Наименование заболевания': 'D56 Талассемия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гематолог – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов и ретикулоцитарного индекса, тромбоцитов – 2 раза в год. БАК (билирубин и его фракции, гаптоглобин, ферритин, сывороточное железо, общий белок, АЛТ, ACT, ЛДГ) – 2 раза в год. ОАМ – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D57.0__D57.1__D57.2__D57.3__D57.4__D57.5__D57.6__D57.7__D57.8__D57.9',
     'Наименование заболевания': 'D57 Серповидно-клеточные нарушения ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 4 раза в год. Врач – детский хирург (врач-хирург) – 2 раза в год. Врач-пульмонолог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 4 раза в год. БАК (билирубин и его фракции, гаптоглобин, АЛТ, ACT, ЛДГ, амилаза, K, Na, СРБ, ферритин) – 2 раза в год. ОАМ – 2 раза в год. ЭКГ – 1 раз в год. УЗИ ОБП – 1 раз в год. Рентгенография органов грудной клетки – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D58.0__D58.1__D58.2__D58.3__D58.4__D58.5__D58.6__D58.7__D58.8__D58.9',
     'Наименование заболевания': 'D58 Другие наследственные гемолитические анемии ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов, ретикулоцитарного индекса, тромбоцитов и лейкоцитарной формулы – 1 раз в 2 месяца (при уровне гемоглобина &lt;100 г/л). При уровне гемоглобина &gt;100 г/л – 2 раза в год. БАК (билирубин и его фракции, гаптоглобин, АЛТ, ACT, гемоглобин плазмы, ферритин, сывороточное железо, ЛДГ, ГГТ) – 2 раза в год. ЭКГ – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D59.0',
     'Наименование заболевания': 'D59.0 Медикаментозная аутоиммунная гемолитическая анемия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год на первом году, далее – 2 раза в год при стойкой клинико-гематологической ремиссии. Врач-гематолог – 1 раз в 6 месяцев на первом году наблюдения, далее – 1 раз з год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов, ретикулоцитарного индекса, тромбоцитов и лейкоцитарной формулы – 4 раза в год на первом году, далее – 2 раза в год при стойкой клинико-гематологической ремиссии. БАК (билирубин и его фракции, гаптоглобин, ACT, АЛТ, гемоглобин плазмы, ферритин, сывороточное железо, ЛДГ, ГГТ) – 2 раза в год. ЭКГ – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета после 5 лет стойкой клинико-гематологической ремиссии '},

    {'mkb_key': 'D60.0__D60.1__D60.2__D60.3__D60.4__D60.5__D60.6__D60.7__D60.8__D60.9',
     'Наименование заболевания': 'D60 Приобретенная чистая красноклеточная аплазия (эритробластопения) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 2 раза в год (до восстановления показателей красной крови), далее – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом числа ретикулоцитов – 1 раз в 3 месяца (до восстановления показателей ОАК). УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета после 5 лет стойкой клинико-гематологической ремиссии '},

    {'mkb_key': 'D61.0__D61.1__D61.2__D61.3__D61.4__D61.5__D61.6__D61.7__D61.8__D61.9',
     'Наименование заболевания': 'D61 Другие апластические анемии ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 1 раз в месяц (на время приема циклоспорина), после завершения иммуносупрессивной терапии – 4 раза в год. Другие врачи-специалисты – по медицинским показаниям. После трансплантации гемопоэтических стволовых клеток составляется индивидуальный план наблюдения на основании рекомендаций организации здравоохранения, оказывающей медицинскую помощь в стационарных условиях. ОАК с подсчетом числа ретикулоцитов и 1 раз в месяц (до восстановления показателей ОАК). БАК (общий белок, ACT, АЛТ, ферритин, сывороточное железо, ЛДГ, мочевина, креатинин, электролиты, ГГТ), уровень циклоспорина А в крови – 1 раз в месяц во время приема циклоспорина, после завершения иммуносупрессивной терапии – 4 раза в год (без уровня циклоспорина). Клиренс по эндогенному креатинину – 4 раза в год. ОАМ – 4 раза в год. ЭКГ, ЭХО-КГ – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет при условии восстановления гематологических показателей. При отсутствии гематологической ремиссии с диспансерного учета не снимаются '},

    {'mkb_key': 'D62.0__D62.1__D62.2__D62.3__D62.4__D62.5__D62.6__D62.7__D62.8__D62.9',
     'Наименование заболевания': 'D62 Острая постгеморрагическая анемия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов – 2 раза в год. БАК (общий белок, сывороточное железо, ОЖСС, ферритин) – 1 раз в год. Копрограмма – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета при сохранении клинико-гематологической ремиссии в течение 1 года '},

    {'mkb_key': 'D64.0__D64.1__D64.2__D64.3__D64.4__D64.5__D64.6__D64.7__D64.8__D64.9',
     'Наименование заболевания': 'D64 Другие анемии ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог, другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом ретикулоцитов, тромбоцитов и лейкоцитарной формулы – по медицинским показаниям (в зависимости от этиологии и результатов терапии). ЭКГ – 1 раз в год. УЗИ ОБП – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета при сохранении клинико-гематологической ремиссии в течение 1 года '},

    {'mkb_key': 'D66.0__D66.1__D66.2__D66.3__D66.4__D66.5__D66.6__D66.7__D66.8__D66.9',
     'Наименование заболевания': 'D66 Наследственный дефицит фактора VIII ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-гематолог (областной уровень) – 1 раз в год. Врач-гематолог (республиканский уровень) – 1 раз в год. Врач-реабилитолог, врач – травматолог-ортопед, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. ОАК, ОАМ, БАК – 1 раз в год. Уровень ингибиторов к VIII фактору и уровень VIII фактора с регистрацией ответа на введение лекарственного средства на основе VIII фактора с последующим обоснованием тактики гемостатической терапии – 1 раз в год (республиканский уровень) ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. По достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'D67.0__D67.1__D67.2__D67.3__D67.4__D67.5__D67.6__D67.7__D67.8__D67.9',
     'Наименование заболевания': 'D67 Наследственный дефицит фактора IX ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-гематолог (областной уровень) – 1 раз в год. Врач-гематолог (республиканский уровень) – 1 раз в год. Врач-реабилитолог, врач – травматолог-ортопед, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. ОАК, ОАМ, БАК – 1 раз в год. Уровень ингибиторов к IX фактору и уровень IX фактора с регистрацией ответа на введение лекарственного средства на основе IX фактора с последующим обоснованием тактики гемостатической терапии – 1 раз в год (республиканский уровень) ',
     'Сроки наблюдения за пациентом': 'С зачета не снимаются. По достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'D68.0__D68.1__D68.2',
     'Наименование заболевания': 'D68.0–D68.2 Другие нарушения свертываемости ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-гематолог (областной уровень) – 1 раз в год. Врач-гематолог (республиканский уровень) – 1 раз в год. Врач-реабилитолог, врач – травматолог-ортопед, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. ОАК, ОАМ – 1 раз в год (по месту жительства (пребывания)). Уровень дефицитного фактора с последующим обоснованием тактики гемостатической терапии – 1 раз в год (республиканский уровень) ',
     'Сроки наблюдения за пациентом': 'С учета не снимаются. По достижении 18 лет наблюдение врача общей практики, врача-гематолога '},

    {'mkb_key': 'D68.8',
     'Наименование заболевания': 'D68.8 Другие уточненные нарушения свертывания ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ, БАК, УЗИ зоны интереса, гемостазиограмма – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D69.0__D69.1__D69.2__D69.3__D69.4__D69.5__D69.6__D69.7__D69.8__D69.9__D69.0',
     'Наименование заболевания': 'D69 Пурпура и другие геморрагические состояния D69.0 Аллергическая пурпура ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. ОАК, ОАМ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета при сохранении клинико-гематологической ремиссии в течение 1 года '},

    {'mkb_key': 'D69.1',
     'Наименование заболевания': 'D69.1 Качественные дефекты тромбоцитов ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики), врач-гематолог – 1 раз в год. Врач-гематолог – по медицинским показаниям (республиканский уровень – при необходимости оценки функции тромбоцитов и обоснования гемостатической терапии). ОАК с ручным подсчетом тромбоцитов и лейкоцитарной формулы – 1 раз в 3 месяца первые 6 месяцев, далее – при стойкой клинико-гематологической ремиссии – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D69.3',
     'Наименование заболевания': 'D69.3 Идиопатическая тромбоцитопеническая пурпура ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев – 1 раз в месяц, далее (при клинико-гематологической ремиссии) – 2 раза в год в течение 2 лет, далее – 1 раз в год. Врач-гематолог – первые 6 месяцев – 1 раз в месяц, далее (при стойкой клинико-гематологической ремиссии) – 2 раза в год в течение 2 лет, далее – 1 раз в год в течение 3 лет. ОАК с ручным подсчетом тромбоцитов и лейкоцитарной формулы – 1 раз в месяц первые 6 месяцев, далее (при стойкой клинико-гематологической ремиссии) – 2 раза в год в течение 2 лет, далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета после 5 лет клинико-гематологической ремиссии '},

    {'mkb_key': 'D70.0__D70.1__D70.2__D70.3__D70.4__D70.5__D70.6__D70.7__D70.8__D70.9__D71.0__D71.1__D71.2__D71.3__D71.4__D71.5__D71.6__D71.7__D71.8__D71.9__D75.0__D75.1__D75.2__D75.3__D75.4__D75.5__D75.6__D75.7__D75.8__D75.9',
     'Наименование заболевания': 'D70 Агранулоцитоз D71 Функциональные нарушения полиморфно-ядерных нейтрофилов D75 Другие болезни крови и кроветворных органов ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – по медицинским показаниям. ОАК с подсчетом абсолютного числа нейтрофилов – 4 раза в год. УЗИ ОБП – 1 раз в год. ОАМ – 4 раза в год ',
     'Сроки наблюдения за пациентом': 'При врожденных формах с учета не снимаются. При приобретенных формах – снятие с учета после 1 года клинико-гематологической ремиссии '},

    {'mkb_key': 'D76.0__D76.1__D76.2__D76.3__D76.4__D76.5__D76.6__D76.7__D76.8__D76.9',
     'Наименование заболевания': 'D76 Отдельные болезни, протекающие с вовлечением лимфоретикулярной ткани и ретикулогистиоцитарной системы ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гематолог – 4 раза в год в течение 1 года, далее – 1 раз в год. ОАК – 4 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета после 5 лет клинико-гематологической ремиссии '},

    {'mkb_key': 'D80.0__D80.1__D80.2__D80.3__D80.4__D80.5__D80.6__D80.7__D80.8__D80.9__D81.0__D81.1__D81.2__D81.3__D81.4__D81.5__D81.6__D81.7__D81.8__D81.9__D82.0__D82.1__D82.2__D82.3__D82.4__D82.5__D82.6__D82.7__D82.8__D82.9__D83.0__D83.1__D83.2__D83.3__D83.4__D83.5__D83.6__D83.7__D83.8__D83.9__D84.0__D84.1__D84.2__D84.3__D84.4__D84.5__D84.6__D84.7__D84.8__D84.9__D85.0__D85.1__D85.2__D85.3__D85.4__D85.5__D85.6__D85.7__D85.8__D85.9__D86.0__D86.1__D86.2__D86.3__D86.4__D86.5__D86.6__D86.7__D86.8__D86.9__D87.0__D87.1__D87.2__D87.3__D87.4__D87.5__D87.6__D87.7__D87.8__D87.9__D88.0__D88.1__D88.2__D88.3__D88.4__D88.5__D88.6__D88.7__D88.8__D88.9__D89.0__D89.1__D89.2__D89.3__D89.4__D89.5__D89.6__D89.7__D89.8__D89.9',
     'Наименование заболевания': 'D80–D89 Отдельные нарушения, вовлекающие иммунный механизм ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-иммунолог, врач-гематолог, врач-онколог – по медицинским показаниям. Другие врачи-специалисты – по медицинским показаниям. ОАК с подсчетом лейкоцитарной формулы – 2 раза в год. БАК – по медицинским показаниям. Иммунограмма, другие обследования – по медицинским показаниям. Обязательное обследование у врача-иммунолога родных братьев и сестер пациента ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E10.0__E10.1__E10.2__E10.3__E10.4__E10.5__E10.6__E10.7__E10.8__E10.9__E11.0__E11.1__E11.2__E11.3__E11.4__E11.5__E11.6__E11.7__E11.8__E11.9__E13.0__E13.1__E13.2__E13.3__E13.4__E13.5__E13.6__E13.7__E13.8__E13.9__E14.0__E14.1__E14.2__E14.3__E14.4__E14.5__E14.6__E14.7__E14.8__E14.9',
     'Наименование заболевания': 'Е10.0–E10.9 Сахарный диабет 1-го типа Е11.0–Е11.9 Сахарный диабет 2-го типа Е13.0–Е13.9 Другие уточненные формы сахарного диабета Е14.0–Е14.9 Сахарный диабет неуточненный ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог для пациентов на инсулинотерапии – 12 раз в год, для пациентов на пероральных сахароснижающих препаратах и безмедикаментозном лечении – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Измерение массы и длины тела, оценка стадии полового развития по Таннеру – 2 раза в год, АД при каждом посещении, ОАК, ОАМ, БАК (общий белок, ОХ, ТГ, ACT, АЛТ, креатинин, мочевина), ЭКГ, УЗИ щитовидной железы – 1 раз в год. Гликированный гемоглобин с использованием методов с коэффициентом вариации менее 4 % – 4 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'R73.0',
     'Наименование заболевания': 'R73.0 Нарушение толерантности к глюкозе ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – по медицинским показаниям. Измерение массы и длины тела, АД – при каждом посещении. Пероральный глюкозотолерантный тест – при верификации диагноза, далее – 1 раз в год. УЗИ ОБП – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До выздоровления. Снятие с учета – при нормальных показателях стандартного перорального глюкозотолерантного теста в течение 2 лет, после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E16.1__E16.2__E16.3__E16.8__E16.9',
     'Наименование заболевания': 'Е16.1–Е16.3, Е16.8–Е16.9 Другие нарушения внутренней секреции поджелудочной железы ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 12 раз в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Измерение массы и длины тела – при каждом посещении. Многократное исследование уровня глюкозы крови в течение суток (профиль) – при верификации диагноза, далее – по медицинским показаниям. БАК (ACT, АЛТ, билирубин, мочевина, креатинин, амилаза, K, Na, хлор, общий белок), УЗИ ОБП – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E01.0__E01.1__E01.2__E01.8__E04.0__E04.1__E04.2__E04.8__E04.9__E07.1',
     'Наименование заболевания': 'Е01.0–Е01.2, Е01.8 Болезни щитовидной железы, связанные с йодной недостаточностью, и сходные состояния Е04.0–Е04.2, Е04.8–Е04.9 Другие формы нетоксического зоба Е07.1 Дисгормональный зоб ',
     'Сроки и кратность медицинских обследований': 'Увеличение размеров щитовидной железы (зоб) без изменения структуры железы – врач-педиатр участковый – 2 раза в год, врач-эндокринолог – 1 раз в год. При структурных изменениях – узловые формы – врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач – детский хирург (врач-хирург) – по медицинским показаниям. Пальпация щитовидной железы – при каждом посещении, УЗИ ЩЖ и региональных лимфатических узлов – при увеличении размеров щитовидной железы (зоб) без изменения структуры железы 1 раз в год, при узловых формах – 2 раза в год. Определение в крови уровня ТТГ при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До выздоровления. Снятие с учета – при нормализации размеров и структуры щитовидной железы по данным УЗИ '},

    {'mkb_key': 'E05.0__E05.1__E05.2__E05.3__E05.4__E05.5__E05.6__E05.7__E05.8__E05.9',
     'Наименование заболевания': 'Е05.0–Е05.9 Тиреотоксикоз ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 12 раз в год – в стадии декомпенсации, 2 раза в год – в стадии ремиссии. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Пальпация щитовидной железы – при каждом посещении. Измерение массы и длины тела, АД – при каждом посещении. ОАК – 1 раз в месяц при лечении тиреостатическими средствами. Глюкоза крови, БАК (ACT, АЛТ) – 1 раз при выявлении, далее – по медицинским показаниям. УЗИ ЩЖ, ЭКГ – 1 раз при выявлении, далее – по медицинским показаниям. УЗИ ОБП, УЗИ сердца – по медицинским показаниям. Определение в крови уровня ТТГ – при верификации диагноза, далее – 1 раз в 3 месяца до достижения компенсации, далее – по медицинским показаниям. Далее – св. Т4 – 1 раз в месяц до достижения компенсации, далее – 1 раз в 3 месяца; АТ к ТПО, АТрТТГ – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До выздоровления. Снятие с учета – через 2 года после прекращения лечения в случае стойкой ремиссии и после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E06.3',
     'Наименование заболевания': 'Е06.3 Аутоиммунный тиреоидит ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – при нарушении функции щитовидной железы – 4 раза в год; при нормальной функции щитовидной железы – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог – 1 раз при выявлении, далее – по показаниям 1 раз в год. Врач-невролог, врач-оториноларинголог – по медицинским показаниям. Пальпация щитовидной железы – при каждом посещении. Измерение массы и длины тела, АД – при каждом посещении. ОАК, глюкоза крови – 1 раз при выявлении. УЗИ ЩЖ – 1 раз в год, ЭКГ – 1 раз при выявлении, далее – по медицинским показаниям. Определение в крови уровня ТТГ, св. Т4 – 1 раз в год, при нарушении функции обследование аналогично обследованию при гипотиреозе (Е01.8) или тиреотоксикозе (Е05); АТ к ТПО – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E03.0__E03.1__E03.2__E03.3__E03.4__E03.5__E03.6__E03.7__E03.8__E03.9',
     'Наименование заболевания': 'Е03.0–Е03.9 Другие формы гипотиреоза ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год, при подборе дозы тиреоидных гормонов, далее – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-невролог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. Пальпация щитовидной железы – при каждом посещении. Измерение массы и длины тела, АД – при каждом посещении. ОАК, БАК (АЛТ, ACT, ОХ, ТГ, глюкоза), ЭКГ, УЗИ ЩЖ – 1 раз в год. УЗИ ОБП – по медицинским показаниям. Определение уровня ТТГ, св. Т4 – 1 раз в 3 месяца для детей до 1 года, старше года – 2 раза в год (по показаниям чаще) ',
     'Сроки наблюдения за пациентом': 'Врожденный – снятие с учета по достижении 18 лет. Приобретенный – до полного клинико-лабораторного выздоровления без приема тиреоидных гормонов, после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E20.0,__E20.8,__E20.9__E89.2',
     'Наименование заболевания': 'Е20.0, Е20.8, Е20.9 Гипопаратиреоз Е89.2 Гипопаратиреоз, возникший после медицинских процедур ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Измерение массы и длины тела – при каждом посещении. БАК (Са, Са ионизированный, Р, ЩФ, глюкоза, креатинин, мочевина, общий белок) – 1 раз в год. ЭКГ – 1 раз в год. УЗИ ЩЖ и паращитовидных желез – при верификации диагноза, далее – по медицинским показаниям. УЗИ органов брюшной полости – при верификации диагноза, далее – по медицинским показаниям. Определение в крови уровня ПТГ – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E21.0,__E21.2',
     'Наименование заболевания': 'Е21.0, Е21.2 Гиперпаратиреоз и другие нарушения паращитовидной (околоушной) железы ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Измерение массы и длины тела, АД – при каждом посещении, ОАК, ОАМ, БАК (Са ионизированный, Р, ЩФ, натрий, калий, хлор) – 1 раз в год. УЗИ ЩЖ и паращитовидных желез; ЭКГ, УЗИ почек – при верификации диагноза, далее – по медицинским показаниям. Определение в крови уровня ПТГ – при верификации диагноза (двукратно), далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E22.0__E22.1__E22.2__E22.3__E22.4__E22.5__E22.6__E22.7__E22.9',
     'Наименование заболевания': 'Е22.0–Е22.7, Е22.9 Гиперфункция гипофиза ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог (глазное дно и поля зрения) – 1 раз в год. Врач-невролог, врач – акушер-гинеколог (врач-уролог) – при верификации диагноза, далее – по медицинским показаниям. Измерение массы и длины тела, АД, оценка стадии полового развития по Таннеру – при каждом посещении. Определение в крови уровня гормонов: пролактин, ФСГ, ЛГ, тестостерон (мальчики), эстрадиол (девочки), ТТГ, св. Т4, кортизол, АКТГ, ИФР-1, б/х анализ крови (общий белок, АЛТ, ACT, мочевина, креатинин, электролиты (ионы натрия, калия, хлора), кальций, фосфор, ЩФ) – при верификации диагноза, далее – по медицинским показаниям. УЗИ щитовидной железы, УЗИ органов брюшной полости, УЗИ органов малого таза (девочки). КТ (МРТ) области гипофиза – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До нормализации уровня пролактина после отмены лечения в течение 1 года. Снятие с учета – после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E22.8',
     'Наименование заболевания': 'Е22.8 Другие состояния гиперфункции гипофиза. Преждевременное половое созревание центрального происхождения ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год на фоне лечения агонистами гонадотропин-рилизинг-гормона, далее – 2 раза з год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог (глазное дно, поля зрения), врач – акушер-гинеколог (врач-уролог), врач-невролог – при верификации диагноза, далее – по медицинским показаниям. Измерение массы и длины тела; оценка стадии полового развития по Таннеру – при каждом посещении, R-графия кисти (костный возраст) – 1 раз в год. Определение в крови уровня гормонов (ФСГ, ЛГ, тестостерон (мальчики), эстрадиол (девочки), ТТГ, св. Т4) – при верификации диагноза, далее – по медицинским показаниям. УЗИ органов малого таза (яичек). КТ (МРТ) области гипофиза – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До начала сроков нормального пубертата (9 лет для девочек и 11 лет для мальчиков). Снятие с учета – по окончании лечения после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E23.0',
     'Наименование заболевания': 'Е23.0 Гипопитуитаризм (изолированная недостаточность: гонадотропина, гормона роста, других гормонов гипофиза; пангипопитуитаризм; гипофизарная кахексия, низкорослость (карликовость) ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог (глазное дно, поля зрения), врач – акушер-гинеколог (врач-уролог), врач-невролог – при верификации диагноза, далее – по медицинским показаниям. Измерение массы и длины тела; оценка стадии полового развития по Таннеру – при каждом посещении. R-графия кисти (костный возраст) – 1 раз в год. Гликемия, ОАМ – при верификации диагноза, далее – по медицинским показаниям. Определение в крови уровня гормонов (ФСГ, ЛГ, тестостерон (мальчики), эстрадиол (девочки), пролактин, АКТГ, кортизол, ТТГ, св. Т4) – при верификации диагноза, далее – по медицинским показаниям. УЗИ ЩЖ и региональных лимфатических узлов, УЗИ органов малого таза для девочек (яичек для мальчиков) – при верификации диагноза, далее – по медицинским показаниям. КТ (МРТ) области гипофиза – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E23.0',
     'Наименование заболевания': 'Е23.0 Гипопитуитаризм (идиопатическая недостаточность гормона роста) ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год на фоне лечения соматропином, далее – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – 1 раз в год при верификации диагноза. Измерение массы и длины тела, пропорции тела, оценка стадии полового развития по Таннеру – при каждом посещении. R-графия кисти (костный возраст) – 1 раз в год. Определение в крови уровня гормонов (ФСГ, ЛГ, тестостерон (мальчики), эстрадиол (девочки), кортизол, ТТГ, св. Т4, ИФР-1) – при верификации диагноза, далее – по медицинским показаниям. КТ (МРТ) области гипофиза – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E23.2',
     'Наименование заболевания': 'Е23.2 Несахарный диабет ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог, врач-отоларинголог – при верификации диагноза, далее – по медицинским показаниям. Измерение массы и длины тела, АД – при каждом посещении. Глюкоза крови, ОАМ, суточный диурез с определением относительной плотности мочи – при верификации диагноза, далее – по медицинским показаниям. Анализ мочи по Зимницкому, БАК (креатинин, K, Na, хлор, ЩФ) – при верификации диагноза, далее – по медицинским показаниям. Определение в крови уровня гормонов (ТТГ, св. Т4, кортизол, АКТГ, тестостерон (мальчики), эстрадиол (девочки), прогестерон (девочки) – по медицинским показаниям. УЗИ ЩЖ и региональных лимфатических узлов, УЗИ органов малого таза для девочек (яичек для мальчиков), ЭКГ – по медицинским показаниям. КТ (МРТ) области гипофиза – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E24.0__E27.0,__E27.8,__E27.9',
     'Наименование заболевания': 'Е24.0 Болезнь Иценко-Кушинга гипофизарного происхождения Е27.0, E27.8, Е27.9 Другие нарушения надпочечников ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-офтальмолог, врач – акушер-гинеколог (врач-уролог), врач-невролог – по медицинским показаниям. Измерение массы и длины тела, АД, оценка стадии полового развития по Таннеру – при каждом посещении. ОАК, ОАМ, БАК (ОХ, ТГ, ЛПВП, АЛТ, ACT, мочевина, креатинин, K, Na, хлор, Са, фосфор, ЩФ), ЭКГ – при верификации диагноза, далее – по медицинским показаниям. Пероральный глюкозотолерантный тест – по медицинским показаниям. Определение в крови уровня гормонов (ФСГ, ЛГ, АКТГ, кортизол, пролактин, тестостерон, эстрадиол, прогестерон) – при верификации диагноза, далее – по медицинским показаниям. УЗИ ОБИ (надпочечники) – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E25.0',
     'Наименование заболевания': 'Е25.0 Врожденные адреногенитальные нарушения, связанные с дефицитом ферментов ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – по показаниям. Врач – акушер-гинеколог (врач-уролог) – при верификации диагноза, далее – по медицинским показаниям. Врач-генетик (кариотип) – при верификации диагноза. Измерение массы тела и роста, АД, оценка стадии полового развития по Таннеру – при каждом посещении. ОАК, БАК (К, Na, Cl, глюкоза, мочевина, креатинин, кальций, фосфор), R-графия кисти (костный возраст), УЗИ надпочечников, гонад – 1 раз в год. Определение в крови уровня гормонов (кортизол, тестостерон 17-гидроксипрогестерон) – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E26.0',
     'Наименование заболевания': 'Е26.0 Первичный гиперальдостеронизм ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-нефролог (врач-уролог), врач-кардиолог, врач-офтальмолог – по медицинским показаниям. Измерение массы и длины тела, АД – при каждом посещении. ОАМ, ЭКГ – при верификации диагноза, далее – по медицинским показаниям. ЭКГ, БАК (креатинин, мочевина, K, Na, хлор) – 2 раза в год. Анализ мочи по Зимницкому – по медицинским показаниям. УЗИ ОБП – при верификации диагноза, далее – по медицинским показаниям. КТ области надпочечников – при верификации диагноза, далее – по показаниям. Определение в крови уровня гормонов (альдостерон, ренин) – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E27.1__E27.3__А18.7__E89.6__E27.4',
     'Наименование заболевания': 'Е27.1 Первичная недостаточность коры надпочечников Е27.3 Медикаментозная недостаточность коры надпочечников А18.7 Болезнь Аддисона туберкулезной этиологии Е89.6 Гипофункция коры надпочечников (мозгового слоя), возникшая после медицинских процедур Е27.4 Другая и неуточненная недостаточность коры надпочечников ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 4 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – по медицинским показаниям. Измерение массы и длины тела, АД – при каждом посещении. ОАК, глюкоза крови, БАК (общий белок, креатинин, мочевина, K, Na, хлор). Определение в крови уровня гормонов (кортизол, АКТГ) – при верификации диагноза, далее – по медицинским показаниям. ЭКГ, УЗИ ОБП (надпочечники) – при верификации диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E28.0__E28.1__E28.2__E28.3__E28.4__E28.5__E28.6__E28.7__E28.8__E28.9__Q96.0__Q96.1__Q96.2__Q96.3__Q96.4__Q96.5__Q96.6__Q96.7__Q96.8__Q96.9__Q99.1__E89.4',
     'Наименование заболевания': 'Е28.0–Е28.9 Дисфункция яичников Q96.0–Q96.9 Синдром Тернера Q99.1 Чистый гонадный дисгенез Е89.4 Нарушение функции яичников, возникшее после медицинских процедур ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач – акушер-гинеколог – 2 раза в год. Измерение массы и длины тела, АД, оценка стадии полового развития по Таннеру – при каждом посещении. Глюкоза крови, УЗИ органов малого таза, УЗИ ОБП – при верификации диагноза, далее – по медицинским показаниям. БАК (АЛТ, ACT, ОХ, ТГ, K, Na, хлор, Са, ионизированный Са, Р, ТГ, ЛПВП, ЛПНП, коэффициент атерогенности, мочевая кислота) – по медицинским показаниям. Определение з крови уровня гормонов (ФСГ, ЛГ, эстрадиол, пролактин, тестостерон) – при верификации диагноза, далее – по медицинским показаниям. УЗИ органов малого таза – при верификации диагноза, далее – по показаниям. УЗИ ЩЖ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До нормализации менструального цикла. Снятие с учета – после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E30.0__E30.1__E30.2__E30.3__E30.4__E30.5__E30.6__E30.7__E30.8__E30.9',
     'Наименование заболевания': 'Е30.0–Е30.9 Нарушения полового созревания, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач – акушер-гинеколог (врач-уролог) – при верификации диагноза. Врач-офтальмолог, врач-невролог – при верификации диагноза. Измерение массы и длины тела, АД, оценка стадии полового развития по Таннеру – при каждом посещении. R-графия кисти (костный возраст) – 1 раз в год. БАК (общий белок, креатинин, мочевина, глюкоза, Са, Р, АЛТ, ACT, натрий, калий, хлор, ЩФ, ОХ, ТГ) – 1 раз в год по медицинским показаниям. Определение в крови уровня гормонов (ТТГ, св. Т4, ФСГ, ЛГ, эстрадиол, пролактин, тестостерон, кортизол) – 1 раз в год. УЗИ органов малого таза для девочек (яичек для мальчиков) – по медицинским показаниям. УЗИ ЩЖ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До начала сроков нормального пубертата (9 лет для девочек и 11 лет для мальчиков). Снятие с учета – после консультации врача-специалиста городского (областного) уровня оказания медицинской помощи '},

    {'mkb_key': 'E34.5',
     'Наименование заболевания': 'Е34.5 Синдром андрогенной резистентности (гермафродитизм) ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач – акушер-гинеколог (врач-уролог) – 2 раза в год. Врач-офтальмолог, врач-невролог – по медицинским показаниям. Измерение массы и длины тела, АД, оценка стадии полового развития по Таннеру – при каждом посещении. R-графия кисти (костный возраст) – 1 раз в год. БАК (общий белок, креатинин, глюкоза, Са, Р, АЛТ, ACT) – по медицинским показаниям. Определение в крови уровня гормонов (ФСГ, ЛГ, эстрадиол, прогестерон, пролактин, тестостерон) – при верификации диагноза, далее – по медицинским показаниям. УЗИ органов малого таза для девочек (яичек для мальчиков) – по медицинским показаниям. УЗИ ЩЖ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с зачета по достижении 18 лет '},

    {'mkb_key': 'E66.0__E66.1',
     'Наименование заболевания': 'Е66.0 Ожирение, обусловленное избыточным поступлением энергетических ресурсов Е66.1 Ожирение, вызванное приемом лекарственных средств ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 1 раз в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-офтальмолог, врач-невролог – по медицинским показаниям. Измерение массы и длины тела, окружности талии, АД, оценка стадии полового развития по Таннеру – при каждом медицинском осмотре. Гликемия; БАК (ACT, АЛТ, ОХ, ТГ), ЭКГ – 1 раз в год. Пероральный глюкозотолерантный тест – 1 раз в год. УЗИ ОБП, УЗИ ЩЖ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До нормализации индекса массы тела, показателей углеводного и липидного обмена '},

    {'mkb_key': 'E66.2',
     'Наименование заболевания': 'Е66.2 Крайняя степень ожирения, сопровождаемая альвеолярной гиповентиляцией. Пиквикский синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-эндокринолог – 2 раза в год. Врач-педиатр участковый (врач-педиатр, врач общей практики) – 1 раз в год. Врач-офтальмолог, врач-невролог – 1 раз в год. Измерение массы и длины тела, окружности талии, АД – при каждом посещении; оценка стадии полового развития по Таннеру – при каждом посещении. Глюкоза крови, БАК (ACT, АЛТ, ОХ, ТГ), ЭКГ – 1 раз в год. Пероральный глюкозотолерантный тест – 1 раз в год. Гормональное исследование крови: ТТГ, св. Т4, эстрадиол (девочки), тестостерон (мальчики), ЛГ, ФСГ, пролактин) – 1 раз в год. УЗИ органов малого таза (яичек) – 1 раз в год. УЗИ ОБП, УЗИ ЩЖ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Р07.1,__Р07.3',
     'Наименование заболевания': 'Р07.1, Р07.3 Расстройства, связанные с укорочением срока беременности и малой массой тела при рождении, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 12 раз в год. Врач-невролог – в 1, 3, 6, 9, 12 месяцев. Врач-офтальмолог – в 1, 3, 6, 9, 12 месяцев. Врач-генетик, врач-эндокринолог – по медицинским показаниям. ОАК, ОАМ – 4 раза в год. Копрограмма – по медицинским показаниям. Контрольное взвешивание и расчет питания – 1 раз в месяц. Антропометрия с оценкой физического развития – 12 раз в год ',
     'Сроки наблюдения за пациентом': 'Достижение показателями физического и нервно-психического развития возрастной нормы '},

    {'mkb_key': 'E40.0__E40.1__E40.2__E40.3__E40.4__E40.5__E40.6__E40.7__E40.8__E40.9__E41.0__E41.1__E41.2__E41.3__E41.4__E41.5__E41.6__E41.7__E41.8__E41.9__E42.0__E42.1__E42.2__E42.3__E42.4__E42.5__E42.6__E42.7__E42.8__E42.9__E43.0__E43.1__E43.2__E43.3__E43.4__E43.5__E43.6__E43.7__E43.8__E43.9__E44.0__E44.1__E44.2__E44.3__E44.4__E44.5__E44.6__E44.7__E44.8__E44.9__E45.0__E45.1__E45.2__E45.3__E45.4__E45.5__E45.6__E45.7__E45.8__E45.9__E46.0__E46.1__E46.2__E46.3__E46.4__E46.5__E46.6__E46.7__E46.8__E46.9',
     'Наименование заболевания': 'Е40–Е46 Недостаточность питания ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 12 раз в год. Врач-невролог – в 3, 12 месяцев. Врач-генетик, врач-эндокринолог – по медицинским показаниям. ОАК – 4 раза в год. ОАМ – 2 раза в год. Копрограмма – по медицинским показаниям. БАК, глюкоза крови, иммунограмма – по медицинским показаниям. Расчет питания – 12 раз в год. Контрольное взвешивание – 12 раз в год. Антропометрия с оценкой физического развития – 12 раз в год ',
     'Сроки наблюдения за пациентом': 'Достижение показателями физического и нервно-психического развития возрастной нормы '},

    {'mkb_key': 'E55.0',
     'Наименование заболевания': 'Е55.0 Рахит активный ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – в стадии разгара – 1 раз в месяц, далее – 1 раз в 3 месяца. Врач – травматолог-ортопед, врач – детский хирург (врач-хирург), врач-невролог, врач-эндокринолог – по медицинским показаниям. ОАК – 4 раза в год. ОАМ – 2 раза в год. БАК (Са, магний (далее – Mg), Р, ЩФ, K, Na) – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'До клинического выздоровления. Снятие с учета – через 2 года для детей, перенесших легкий рахит, через 3 года – для перенесших среднетяжелый и тяжелый рахит '},

    {'mkb_key': 'A80.0__А80.1__А80.2__А80.3__А80.4__А80.5__А80.6__А80.7__А80.8__А80.9__А81.0__А81.1__А81.2__А81.3__А81.4__А81.5__А81.6__А81.7__А81.8__А81.9__А82.0__А82.1__А82.2__А82.3__А82.4__А82.5__А82.6__А82.7__А82.8__А82.9__А83.0__А83.1__А83.2__А83.3__А83.4__А83.5__А83.6__А83.7__А83.8__А83.9__А84.0__А84.1__А84.2__А84.3__А84.4__А84.5__А84.6__А84.7__А84.8__А84.9__А85.0__А85.1__А85.2__А85.3__А85.4__А85.5__А85.6__А85.7__А85.8__А85.9__А86.0__А86.1__А86.2__А86.3__А86.4__А86.5__А86.6__А86.7__А86.8__А86.9__А87.0__А87.1__А87.2__А87.3__А87.4__А87.5__А87.6__А87.7__А87.8__А87.9__А88.0__А88.1__А88.2__А88.3__А88.4__А88.5__А88.6__А88.7__А88.8__А88.9__А89.0__А89.1__А89.2__А89.3__А89.4__А89.5__А89.6__А89.7__А89.8__А89.9__G00.0__G00.1__G00.2__G00.3__G00.4__G00.5__G00.6__G00.7__G00.8__G00.9__G01.0__G01.1__G01.2__G01.3__G01.4__G01.5__G01.6__G01.7__G01.8__G01.9__G02.0__G02.1__G02.2__G02.3__G02.4__G02.5__G02.6__G02.7__G02.8__G02.9__G03.0__G03.1__G03.2__G03.3__G03.4__G03.5__G03.6__G03.7__G03.8__G03.9__G04.0__G04.1__G04.2__G04.3__G04.4__G04.5__G04.6__G04.7__G04.8__G04.9__G05.0__G05.1__G05.2__G05.3__G05.4__G05.5__G05.6__G05.7__G05.8__G05.9__G06.0__G06.1__G06.2__G06.3__G06.4__G06.5__G06.6__G06.7__G06.8__G06.9__G07.0__G07.1__G07.2__G07.3__G07.4__G07.5__G07.6__G07.7__G07.8__G07.9__G08.0__G08.1__G08.2__G08.3__G08.4__G08.5__G08.6__G08.7__G08.8__G08.9__G09.0__G09.1__G09.2__G09.3__G09.4__G09.5__G09.6__G09.7__G09.8__G09.9',
     'Наименование заболевания': 'A80–А89 Вирусные инфекции центральной нервной системы G00–G09 Воспалительные болезни центральной нервной системы ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год на первом году, далее – 2 раза в год. Врач-невролог – первый раз через 1–1,5 месяца после выписки из стационара, далее – 4 раза в год в течение первого года наблюдения, далее – 2 раза в год. Врач-окулист – через 1, 3 месяца после выписки, далее – 2 раза в год. Врач-сурдолог – в первые 3 месяца после выписки, далее – по медицинским показаниям. ЭЭГ – 2 раза в первые полгода после выписки, далее – 2 раза в год. МРТ – по медицинским показаниям. УЗИ головного мозга (детям первого года жизни) – 1 раз через 3 месяца после выздоровления ',
     'Сроки наблюдения за пациентом': 'В течение 3 лет. При наличии органической патологии центральной нервной системы (далее – ЦНС) – в течение 5 лет. При нейроборрелиозе 3-й стадии – снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G09.0__G09.1__G09.2__G09.3__G09.4__G09.5__G09.6__G09.7__G09.8__G09.9',
     'Наименование заболевания': 'G09 Последствия воспалительных болезней ЦНС при наличии стойких неврологических нарушений ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на 1-м году жизни – 4 раза в год, далее – 2 раза в год. Врач-офтальмолог – по медицинским показаниям. ЭЭГ, КТ (МРТ) головного (спинного) мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 1-го года с момента окончания острого периода. Снятие с учета – при отсутствии неврологических нарушений '},

    {'mkb_key': 'G11.0__G11.1__G11.2__G11.3__G11.4__G11.5__G11.6__G11.7__G11.8__G11.9',
     'Наименование заболевания': 'G11.0–G11.9 Наследственная атаксия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач – травматолог-ортопед – по медицинским показаниям. МРТ головного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G12.0__G12.1__G12.2__G12.3__G12.4__G12.5__G12.6__G12.7__G12.8__G12.9',
     'Наименование заболевания': 'G12.0–G12.9 Спинальные мышечные атрофии и родственные синдромы ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач – травматолог-ортопед – по медицинским показаниям. R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G24.0__G24.1__G24.2__G24.3__G24.4__G24.5__G24.6__G24.7__G24.8__G24.9__G25.2__G25.3__G25.4__G25.5__G25.6__G25.7__G25.8__G25.9',
     'Наименование заболевания': 'G24 Дистония G25.2–G25.9 Другие экстрапирамидные и двигательные нарушения ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. КТ (МРТ) головного мозга, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E70.0__E70.1__E70.2__E70.3__E70.4__E70.5__E70.6__E70.7__E70.8__E70.9__E71.0__E71.1__E71.2__E71.3__E71.4__E71.5__E71.6__E71.7__E71.8__E71.9__E72.0__E72.1__E72.2__E72.3__E72.4__E72.5__E72.6__E72.7__E72.8__E72.9__E73.0__E73.1__E73.2__E73.3__E73.4__E73.5__E73.6__E73.7__E73.8__E73.9__E74.0__E74.1__E74.2__E74.3__E74.4__E74.5__E74.6__E74.7__E74.8__E74.9__E75.0__E75.1__E75.2__E75.3__E75.4__E75.5__E75.6__E75.7__E75.8__E75.9__E76.0__E76.1__E76.2__E76.3__E76.4__E76.5__E76.6__E76.7__E76.8__E76.9__E77.0__E77.1__E77.2__E77.3__E77.4__E77.5__E77.6__E77.7__E77.8__E77.9__E78.0__E78.1__E78.2__E78.3__E78.4__E78.5__E78.6__E78.7__E78.8__E78.9__E79.0__E79.1__E79.2__E79.3__E79.4__E79.5__E79.6__E79.7__E79.8__E79.9__E80.0__E80.1__E80.2__E80.3__E80.4__E80.5__E80.6__E80.7__E80.8__E80.9__E81.0__E81.1__E81.2__E81.3__E81.4__E81.5__E81.6__E81.7__E81.8__E81.9__E82.0__E82.1__E82.2__E82.3__E82.4__E82.5__E82.6__E82.7__E82.8__E82.9__E83.0__E83.1__E83.2__E83.3__E83.4__E83.5__E83.6__E83.7__E83.8__E83.9__E84.0__E84.1__E84.2__E84.3__E84.4__E84.5__E84.6__E84.7__E84.8__E84.9__E85.0__E85.1__E85.2__E85.3__E85.4__E85.5__E85.6__E85.7__E85.8__E85.9__E86.0__E86.1__E86.2__E86.3__E86.4__E86.5__E86.6__E86.7__E86.8__E86.9__E87.0__E87.1__E87.2__E87.3__E87.4__E87.5__E87.6__E87.7__E87.8__E87.9__E88.0__E88.1__E88.2__E88.3__E88.4__E88.5__E88.6__E88.7__E88.8__E88.9__E89.0__E89.1__E89.2__E89.3__E89.4__E89.5__E89.6__E89.7__E89.8__E89.9__E90.0__E90.1__E90.2__E90.3__E90.4__E90.5__E90.6__E90.7__E90.8__E90.9',
     'Наименование заболевания': 'Е70–Е90 Нарушения обмена веществ при наличии неврологических нарушений ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 4 раза в год. МРТ (КТ) головного мозга, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G31.0__G31.1__G31.2__G31.3__G31.4__G31.5__G31.6__G31.7__G31.8__G31.9',
     'Наименование заболевания': 'G31.0–G31.9 Другие уточненные дегенеративные болезни нервной системы, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 4 раза в год. МРТ (КТ) головного мозга, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G35.0__G35.1__G35.2__G35.3__G35.4__G35.5__G35.6__G35.7__G35.8__G35.9__G36.0__G36.1__G36.2__G36.3__G36.4__G36.5__G36.6__G36.7__G36.8__G36.9__G37.0__G37.1__G37.2__G37.3__G37.4__G37.5__G37.6__G37.7__G37.8__G37.9',
     'Наименование заболевания': 'G35–G37 Демиелинизирующие болезни центральной нервной системы ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-офтальмолог, врач – травматолог-ортопед – по медицинским показаниям. МРТ головного (спинного) мозга, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G40.0__G40.1__G40.2__G40.3__G40.4__G40.5__G40.6__G40.7__G40.8__G40.9',
     'Наименование заболевания': 'G40 Эпилепсия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – при частых припадках – 12 раз в год, при припадках средней частоты – 4 раза в год, при редких или при отсутствии припадков – 2 раза в год. МРТ (КТ) головного мозга – по медицинским показаниям, ЭЭГ – 2 раза в год. Определение уровня антиконвульсантов в крови – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 5 лет после отмены антиконвульсантов. Снятие с учета – при отсутствии припадков не менее 5 лет после отмены противоэпилептического лечения '},

    {'mkb_key': '',
     'Наименование заболевания': 'Судороги, не классифицированные в других рубриках (R56): судороги при лихорадке (R56.0) другие и неуточненные судороги (R56.8), в том числе однократный судорожный приступ ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – при частых припадках – 12 раз в год, при припадках средней частоты – 4 раза в год, при редких или при отсутствии припадков – 2 раза в год. МРТ (КТ) головного мозга – по медицинским показаниям. ЭЭГ – 2 раза в год. Определение уровня антиконвульсантов в крови – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Другие и неуточненные судороги (R56.8): в течение 5 лет после отмены противоэпилептического лечения. Снятие с учета – при отсутствии припадков не менее 5 лет после отмены противоэпилептического лечения. Однократный судорожный приступ при отсутствии назначенного противоэпилептического лечения: снятие с учета через 2 года после приступа. Судороги при лихорадке (R56.0): снятие с учета после достижения возраста 6 лет '},

    {'mkb_key': 'G43.0__G43.1__G43.2__G43.3__G43.4__G43.5__G43.6__G43.7__G43.8__G43.9',
     'Наименование заболевания': 'G43.0–G43.9 Мигрень ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-офтальмолог – по показаниям. ЭЭГ, МРТ (КТ) головного мозга – по медицинским показаниям. Исследование глазного дна – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет после исчезновения симптомов. Снятие с учета – при отсутствии симптомов в течение 2 лет '},

    {'mkb_key': 'G44.0__G44.1__G44.2__G44.3',
     'Наименование заболевания': 'G44.0–G44.3 Другие синдромы головной боли ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-офтальмолог – по медицинским показаниям. ЭЭГ, МРТ (КТ) головного мозга – по медицинским показаниям. Исследование глазного дна – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии симптомов в течение 2 лет '},

    {'mkb_key': 'G50.0__G50.1__G50.2__G50.3__G50.4__G50.5__G50.6__G50.7__G50.8__G50.9__G51.0__G51.1__G51.2__G51.3__G51.4__G51.5__G51.6__G51.7__G51.8__G51.9__G52.0__G52.1__G52.2__G52.3__G52.4__G52.5__G52.6__G52.7__G52.8__G52.9',
     'Наименование заболевания': 'G50 Поражения тройничного нерва G51 Поражения лицевого нерва G52 Поражения других черепных нервов ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-нейрохирург – по медицинским показаниям. МРТ (КТ) головного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'G54.0__G54.1__G54.2__G54.3__G54.4__G54.5__G54.6__G54.7__G54.8__G54.9__G56.0__G56.1__G56.2__G56.3__G56.4__G56.5__G56.6__G56.7__G56.8__G56.9__G57.0__G57.1__G57.2__G57.3__G57.4__G57.5__G57.6__G57.7__G57.8__G57.9__G58.0__G58.1__G58.2__G58.3__G58.4__G58.5__G58.6__G58.7__G58.8__G58.9',
     'Наименование заболевания': 'G54 Поражения нервных корешков и сплетений G56 Мононевропатии верхних конечностей G57 Мононевропатии нижних конечностей G58 Другие мононевропатии ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-нейрохирург, врач – травматолог-ортопед – по медицинским показаниям. КТ (МРТ) спинного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'G60.0__G60.1__G60.2__G60.3__G60.4__G60.5__G60.6__G60.7__G60.8__G60.9',
     'Наименование заболевания': 'G60.0–G60.9 Наследственная и идиопатическая невропатия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач – травматолог-ортопед – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G61.0__G61.1__G61.2__G61.3__G61.4__G61.5__G61.6__G61.7__G61.8__G61.9',
     'Наименование заболевания': 'G61.0–G61.9 Воспалительная полиневропатия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-нейрохирург, врач – травматолог-ортопед – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'G70.0__G70.1__G70.2__G70.3__G70.4__G70.5__G70.6__G70.7__G70.8__G70.9',
     'Наименование заболевания': 'G70.0–G70.9 Myasthenia gravis и другие нарушения нервно-мышечного синапса ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-иммунолог, врач-хирург – по медицинским показаниям. КТ (МРТ) вилочковой железы – по показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G71.0__G71.1__G71.2__G71.3__G72.0__G72.1__G72.2__G72.3__G72.4__G72.5__G72.6__G72.7__G72.8__G72.9',
     'Наименование заболевания': 'G71.0–G71.3 Первичные поражения мышц G72.0–G72.9 Другие миопатии ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач – травматолог-ортопед – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G80.0__G80.1__G80.2__G80.3__G80.4__G80.5__G80.6__G80.7__G80.8__G80.9',
     'Наименование заболевания': 'G80.0–G80.9 Детский церебральный паралич ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач – травматолог-ортопед, врач-сурдолог, врач-офтальмолог, врач – психиатр-нарколог, логопед – по медицинским показаниям. ЭЭГ, КТ (МРТ) головного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'G81.0__G81.1__G81.2__G81.3__G81.4__G81.5__G81.6__G81.7__G81.8__G81.9',
     'Наименование заболевания': 'G81.0–G81.9 Гемиплегия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач – травматолог-ортопед, врач-сурдолог, врач-офтальмолог, врач – психиатр-нарколог, логопед – по медицинским показаниям. ЭЭГ, КТ (МРТ) головного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'G82.0__G82.1__G82.2__G82.3__G82.4__G82.5',
     'Наименование заболевания': 'G82.0–G82.5 Параплегия и тетраплегия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач – травматолог-ортопед, врач-сурдолог, врач-офтальмолог, логопед – по медицинским показаниям. ЭЭГ, КТ (МРТ) головного мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'G90.0__G90.1__G90.2__G90.3__G90.4__G90.5__G90.6__G90.7__G90.8__G90.9',
     'Наименование заболевания': 'G90.0–G90.9 Расстройства вегетативной (автономной) нервной системы ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-офтальмолог – по медицинским показаниям. ЭЭГ – 1 раз в год. Профиль АД – 2 раза в год. Исследование глазного дна – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов в течение 1-го года '},

    {'mkb_key': 'G91.0__G91.1__G91.2__G91.3__G91.4__G91.5__G91.6__G91.7__G91.8__G91.9__Q03.0__Q03.1__Q03.2__Q03.3__Q03.4__Q03.5__Q03.6__Q03.7__Q03.8__Q03.9',
     'Наименование заболевания': 'G91 Гидроцефалия Q03.0–Q03.9 Врожденная гидроцефалия ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – в первые 6 месяцев – 1 раз в 2 месяца, с 7-го по 12-й месяц – 1 раз в 3 месяца, далее – 2 раза в год. Врач-офтальмолог, врач-нейрохирург – по медицинским показаниям. УЗИ головного мозга на первом году – 1 раз в 2 месяца. КТ (МРТ) головного мозга – 1 раз на первом году. Исследование глазного дна, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии клинических симптомов внутричерепной гипертензии '},

    {'mkb_key': 'G95.0__G95.1',
     'Наименование заболевания': 'G95.0–G95.1 Другие болезни спинного мозга ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год. Врач-нейрохирург, врач – травматолог-ортопед – по медицинским показаниям. КТ (МРТ) спинного мозга – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q02.0__Q02.1__Q02.2__Q02.3__Q02.4__Q02.5__Q02.6__Q02.7__Q02.8__Q02.9__Q03.0__Q03.1__Q03.2__Q03.3__Q03.4__Q03.5__Q03.6__Q03.7__Q03.8__Q03.9__Q04.0__Q04.1__Q04.2__Q04.3__Q04.4__Q04.5__Q04.6__Q04.7__Q04.8__Q04.9__Q05.0__Q05.1__Q05.2__Q05.3__Q05.4__Q05.5__Q05.6__Q05.7__Q05.8__Q05.9__Q06.0__Q06.1__Q06.2__Q06.3__Q06.4__Q06.5__Q06.6__Q06.7__Q06.8__Q06.9__Q07.0__Q07.1__Q07.2__Q07.3__Q07.4__Q07.5__Q07.6__Q07.7__Q07.8__Q07.9',
     'Наименование заболевания': 'Q02–Q07 Врожденные аномалии (пороки развития) нервной системы ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-офтальмолог, врач-оториноларинголог, врач-уролог – по медицинским показаниям. УЗИ головного мозга – по показаниям. КТ (МРТ) головного (спинного) мозга – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I02.0__I02.1__I02.2__I02.3__I02.4__I02.5__I02.6__I02.7__I02.8__I02.9',
     'Наименование заболевания': 'I02 Ревматическая хорея (при поражении нервной системы: малая хорея) ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – при наличии симптомов – 4 раза в год, при отсутствии симптомов – 2 раза в год. Врач-ревматолог – 2 раза в год. Врач-офтальмолог, врач-оториноларинголог – по медицинским показаниям. ЭКГ, ОАК, БАК, ОАМ – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов и изменений в биохимических показателях крови. Снятие с учета – при отсутствии клинических проявлений, нормализации биохимических показателей крови в течение 2 лет '},

    {'mkb_key': 'S06.2__S06.3__S06.4__S06.5__S06.6__S06.7__S06.8__S06.9',
     'Наименование заболевания': 'S06.2–S06.9 Внутричерепная травма ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-нейрохирург, врач – травматолог-ортопед – по медицинским показаниям. КТ (МРТ) головного мозга – по медицинским показаниям. ЭЭГ – 2 раза в год, глазное дно – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'S14.0__S14.1__S14.2__S14.3__S14.4__S14.5__S14.6__S14.7__S14.8__S14.9__S24.0__S24.1__S24.2__S24.3__S24.4__S24.5__S24.6__S24.7__S24.8__S24.9__S34.0__S34.1__S34.2__S34.3__S34.4__S34.5__S34.6__S34.7__S34.8__S34.9',
     'Наименование заболевания': 'S14, S24, S34 Травмы шеи ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог на первом году – 4 раза в год, далее – 2 раза в год. Врач-нейрохирург, врач – травматолог-ортопед – по медицинским показаниям. КТ (МРТ) спинного мозга – по медицинским показаниям. ЭЭГ – 2 раза в год, глазное дно – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'I60.0__I60.1__I60.2__I60.3__I60.4__I60.5__I60.6__I60.7__I60.8__I60.9__I61.0__I61.1__I61.2__I61.3__I61.4__I61.5__I61.6__I61.7__I61.8__I61.9__I62.0__I62.1__I62.2__I62.3__I62.4__I62.5__I62.6__I62.7__I62.8__I62.9__I63.0__I63.1__I63.2__I63.3__I63.4__I63.5__I63.6__I63.7__I63.8__I63.9__I64.0__I64.1__I64.2__I64.3__I64.4__I64.5__I64.6__I64.7__I64.8__I64.9__I65.0__I65.1__I65.2__I65.3__I65.4__I65.5__I65.6__I65.7__I65.8__I65.9__I66.0__I66.1__I66.2__I66.3__I66.4__I66.5__I66.6__I66.7__I66.8__I66.9__I67.0__I67.1__I67.2__I67.3__I67.4__I67.5__I67.6__I67.7__I67.8__I67.9__I68.0__I68.1__I68.2__I68.3__I68.4__I68.5__I68.6__I68.7__I68.8__I68.9__I69.0__I69.1__I69.2__I69.3__I69.4__I69.5__I69.6__I69.7__I69.8__I69.9',
     'Наименование заболевания': 'I60–I69 Цереброваскулярные болезни ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог первые 3 месяца – 1 раз в месяц, далее – 1 раз в 3 месяца, через 1 год – 2 раза в год. Врач-нейрохирург, врач-офтальмолог, врач – травматолог-ортопед – по медицинским показаниям. КТ (МРТ) головного мозга – по медицинским показаниям. ЭЭГ – 2 раза в год. Исследование глазного дна и профиль АД – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'Q85.0__Q85.1__Q85.2__Q85.3__Q85.4__Q85.5__Q85.6__Q85.7__Q85.8__Q85.9',
     'Наименование заболевания': 'Q85.0–Q85.9 Факоматозы, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог – 2 раза в год, врач-нейрохирург, врач-офтальмолог, врач-дерматовенеролог – по медицинским показаниям. КТ (МРТ) головного мозга – при прогрессировании заболевания. ЭЭГ (при поражении центральной нервной системы), глазное дно – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': '',
     'Наименование заболевания': 'Нарушение моторного (психомоторного, речевого) развития у детей раннего возраста (до 3 лет) вследствие перинатальной патологии: задержка этапов развития (R62.0); другие общие расстройства развития (R 62.9); специфические расстройства развития моторной функции (F82) ',
     'Сроки и кратность медицинских обследований': 'Врач-невролог в возрасте 1, 3, 6, 9, 12 месяцев, далее – по медицинским показаниям. Врач-офтальмолог, врач-ортопед, врач-оториноларинголог – по медицинским показаниям. НСГ – в возрасте до 1 года. МРТ (КТ) головного (спинного) мозга – по медицинским показаниям. ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В период сохранения симптомов. Снятие с учета – при отсутствии симптомов '},

    {'mkb_key': 'Q15.0',
     'Наименование заболевания': 'Q15.0 Врожденная глаукома ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – при компенсации внутриглазного давления – 2–3 раза в год, при декомпенсации – по медицинским показаниям. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Гониоскопия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'H40.0__H40.1__H40.2__H40.3__H40.4__H40.5__H40.6__H40.7__H40.8__H40.9__H41.0__H41.1__H41.2__H41.3__H41.4__H41.5__H41.6__H41.7__H41.8__H41.9__H42.0__H42.1__H42.2__H42.3__H42.4__H42.5__H42.6__H42.7__H42.8__H42.9',
     'Наименование заболевания': 'H40–H42 Глаукома ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – при компенсации внутриглазного давления – 4 раза в год, при декомпенсации – по медицинским показаниям. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Гониоскопия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q12.0',
     'Наименование заболевания': 'Q12.0 Врожденные аномалии (пороки развития) хрусталика ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-офтальмолога после оперативного лечения '},

    {'mkb_key': 'Н26.0__Н26.1__Н26.2__Н26.3__Н26.4__Н26.5__Н26.6__Н26.7__Н26.8__Н26.9__Н27.0__Н27.1__Н27.2__Н27.3__Н27.4__Н27.5__Н27.6__Н27.7__Н27.8__Н27.9__Н28.0',
     'Наименование заболевания': 'Н26.0–Н28.0 Болезни хрусталика ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-офтальмолога после операции '},

    {'mkb_key': 'C69.0__C69.1__C69.2__C69.3__C69.4__C69.5__C69.6__C69.7__C69.8__C69.9__C49.0__C41.0',
     'Наименование заболевания': 'C69 Злокачественные новообразования глаза и его придаточного аппарата С49.0 Злокачественные новообразования других типов соединительной и мягких тканей (века) С41.0 Злокачественные новообразования костей и суставных хрящей других и неуточненных локализаций (костей глазницы) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-онколог – 4 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'A18.5',
     'Наименование заболевания': 'A18.5 Туберкулез глаз ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-фтизиатр – 1 раз в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. ОАК, БАК, ОАМ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-офтальмолога, не ранее чем через 5 лет после последнего обострения '},

    {'mkb_key': 'Н52.1',
     'Наименование заболевания': 'Н52.1 Миопия (миопия высокой степени – более 6 Д; миопия средней степени от 3,5 до 5,5 Д с изменениями глазного дна) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н52.0',
     'Наименование заболевания': 'Н52.0 Гиперметропия (гиперметропия высокой степени – более 5,5 Д) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н52.2',
     'Наименование заболевания': 'Н52.2 Астигматизм (более 3,0 Д) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'H52.7',
     'Наименование заболевания': 'H52.7 Нарушение рефракции неуточненное (снижающие остроту зрения ниже 0,5 с коррекцией) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н50.0__Н50.1__Н50.2__Н50.3__Н50.4__Н50.5__Н50.6__Н50.7__Н50.8__Н50.9',
     'Наименование заболевания': 'Н50.0–Н50.9 Другие формы косоглазия ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-невролог – по показаниям. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н49.0__Н49.1__Н49.2__Н49.3__Н49.4__Н49.5__Н49.6__Н49.7__Н49.8__Н49.9',
     'Наименование заболевания': 'Н49.0–Н49.9 Паралитическое косоглазие ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-невролог – по показаниям. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н53.9',
     'Наименование заболевания': 'Н53.9 Расстройство зрения неуточненное (амблиопия) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 4 раза в год. Врач-невролог – 1 раз в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-офтальмолога '},

    {'mkb_key': 'Н46.0__Н46.1__Н46.2__Н46.3__Н46.4__Н46.5__Н46.6__Н46.7__Н46.8__Н46.9__Н48.1,__Н48.8',
     'Наименование заболевания': 'Н46 Незрит зрительного нерва Н48.1, Н48.8 Поражения зрительного (2-го) нерва и зрительных путей при болезнях, классифицированных в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-невролог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н47.7',
     'Наименование заболевания': 'Н47.7 Болезни зрительных проводящих путей неуточненные (атрофия зрительного нерва) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-невролог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н48.8',
     'Наименование заболевания': 'Н48.8 Другие поражения зрительного нерва и зрительных путей при болезнях, классифицируемых в других рубриках (дистрофические и воспалительные заболевания зрительного нерва) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Врач-невролог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н35.0__Н35.1__Н35.2__Н35.3__Н35.4__Н35.5__Н35.6__Н35.7__Н35.8__Н35.9__Н36.0__Н36.1__Н36.2__Н36.3__Н36.4__Н36.5__Н36.6__Н36.7__Н36.8__Н36.9',
     'Наименование заболевания': 'Н35 Другие болезни сетчатки Н36 Поражения сетчатки при болезнях, классифицируемых в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н33.0__Н33.1__Н33.2__Н33.3__Н33.4__Н33.5__Н33.6__Н33.7__Н33.8__Н33.9__Q14.1',
     'Наименование заболевания': 'Н33 Отслойка и разрывы сетчатки Q14.1 Врожденная аномалия сетчатки ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н10.4,__Н10.5',
     'Наименование заболевания': 'Н10.4, Н10.5 Конъюнктивит (хронический) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 4 раза в год. Острота зрения с коррекцией. Биомикроскопия. Офтальмоскопия. Мазок на флору с конъюнктивы ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет после последнего обострения '},

    {'mkb_key': 'Н01.0',
     'Наименование заболевания': 'Н01.0 Блефарит (хронический) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 4 раза в год. Острота зрения с коррекцией. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет после последнего обострения '},

    {'mkb_key': 'H16.0__H16.1__H16.2__H16.3__H16.4__H16.5__H16.6__H16.7__H16.8__H16.9',
     'Наименование заболевания': 'H16 Кератит ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет после последнего обострения '},

    {'mkb_key': 'Н20.0__Н20.1__Н20.2__Н20.3__Н20.4__Н20.5__Н20.6__Н20.7__Н20.8__Н20.9__Н22.0',
     'Наименование заболевания': 'Н20 Иридоциклит Н22.0 Иридоциклит при болезнях, классифицируемых в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 4 раза в год. Острота зрения с коррекцией. Биомикроскопия. Офтальмоскопия ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет после последнего обострения '},

    {'mkb_key': 'Н30.0__Н30.1__Н30.2__Н30.3__Н30.4__Н30.5__Н30.6__Н30.7__Н30.8__Н30.9__Н32.0__Н32.1__Н32.2__Н32.3__Н32.4__Н32.5__Н32.6__Н32.7__Н32.8__Н32.9',
     'Наименование заболевания': 'Н30 Хориоретинальное воспаление Н32 Хориоретинальные нарушения при болезнях, классифицируемых в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н04.9',
     'Наименование заболевания': 'Н04.9 Болезнь слезного аппарата неуточненная (хронический дакриоцистит) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-офтальмолога '},

    {'mkb_key': 'S05.0__S05.1__S05.2__S05.3__S05.4__S05.5__S05.6__S05.7__S05.8__S05.9',
     'Наименование заболевания': 'S05 Травмы глаза и глазницы (последствия тяжелых повреждений глаз) ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией. Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н54.4__Q11.1',
     'Наименование заболевания': 'Н54.4 Слепота одного глаза Q11.1 Анофтальм ',
     'Сроки и кратность медицинских обследований': 'Врач-офтальмолог – 2 раза в год. Острота зрения с коррекцией Тонометрия. Поле зрения. Биомикроскопия. Офтальмоскопия. Эхобиометрия ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н66.1',
     'Наименование заболевания': 'Болезни уха и сосцевидного отростка Н66.1 Хронический туботимпанальный гнойный средний отит ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. При гноетечении – лечение обострения у врача-оториноларинголога. Врач-невролог, врач-офтальмолог – 1 раз в год. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'Н66.2',
     'Наименование заболевания': 'Н66.2 Хронический гнойный эпитимпаноантральный гнойный средний отит ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. При гноетечении – лечение обострения у врача-оториноларинголога. Врач-невролог, врач-офтальмолог – 1 раз в год. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н65.4__Н74.1',
     'Наименование заболевания': 'Н65.4 Другие хронические негнойные средние отиты Н74.1 Адгезивная болезнь среднего уха ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 4 раза в год. Врач-иммунолог, врач-аллерголог – по медицинским показаниям. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'Н90.3,__Н90.4',
     'Наименование заболевания': 'Н90.3, Н90.4 Кондуктивная и нейросенсорная потеря слуха ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. Врач-сурдолог, врач-невролог, врач-офтальмолог – 1 раз в год. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J32.0__J32.1__J32.2__J32.3__J32.4',
     'Наименование заболевания': 'J32.0–J32.4 Хронический синусит ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. Врач-стоматолог детский (врач-стоматолог), врач-аллерголог, врач-иммунолог – по медицинским показаниям. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'J35.0',
     'Наименование заболевания': 'J35.0 Тонзиллит хронический (компенсированная форма) ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. Врач-стоматолог детский (врач-стоматолог), врач-аллерголог, врач-иммунолог, врач-ревматолог – по медицинским показаниям. ОАК, БАК (АСЛ-О), ОАМ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'J35.0',
     'Наименование заболевания': 'J35.0 Тонзиллит хронический (декомпенсированная форма) ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год (при отказе от хирургического лечения). Врач-стоматолог детский (врач-стоматолог), врач-аллерголог, врач-иммунолог, врач-ревматолог – по медицинским показаниям. OAК, БАК (АСЛ-О), ОАМ – 1 раз з год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'J35.3',
     'Наименование заболевания': 'J35.3 Гипертрофия миндалин с гипертрофией аденоидов ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог – 2 раза в год. Врач-стоматолог детский (врач-стоматолог), врач-аллерголог, врач-иммунолог, врач-ревматолог – по медицинским показаниям. ОАК, БАК (АСЛ-О), ОАМ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – по заключению врача-оториноларинголога '},

    {'mkb_key': 'J37.0,__J37.1__J38.2',
     'Наименование заболевания': 'J37.0, J37.1 Хронический ларингит и ларинготрахеит J38.2 Узелки голосовых складок ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог, врач-фониатр – 2 раза в год. Врач-фтизиатр, врач-онколог, врач-пульмонолог – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J38.0,__J38.6',
     'Наименование заболевания': 'J38.0, J38.6 Болезни голосовых складок и гортани, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-оториноларинголог – 12 раз в год. Врач-онколог, врач-фониатр, врач-пульмонолог, врач-эндокринолог, врач-невролог, врач – психиатр-нарколог, врач-психотерапевт, логопед, врач-гастроэнтеролог, врач-офтальмолог, врач-кардиолог – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D14.1,__D14.2',
     'Наименование заболевания': 'D14.1, D14.2 Доброкачественное новообразование среднего уха и органов дыхания (папилломатоз гортани, трахеи и другие подобные заболевания) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-оториноларинголог – 12 раз в год. Врач-онколог, врач-фониатр, врач-пульмонолог, врач-экдокринолог, врач-невролог, врач – психиатр-нарколог, врач-психотерапевт, логопед, врач-гастроэнтеролог, врач-офтальмолог, врач-кардиолог – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Н90.3',
     'Наименование заболевания': 'Н90.3 Нейросенсорная потеря слуха двусторонняя ',
     'Сроки и кратность медицинских обследований': 'Врач-оториноларинголог: первый год – 2 раза в год, далее – 1 раз в год. ОАК – при направлении к врачу-оториноларингологу ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I00.0__I00.1__I00.2__I00.3__I00.4__I00.5__I00.6__I00.7__I00.8__I00.9__I01.0__I01.1__I01.2__I01.3__I01.4__I01.5__I01.6__I01.7__I01.8__I01.9__I02.0__I02.1__I02.2__I02.3__I02.4__I02.5__I02.6__I02.7__I02.8__I02.9',
     'Наименование заболевания': 'I00–I02 Острая ревматическая лихорадка ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 1 раз в 3 месяца в течение первого полугодия, далее – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, БАК (СРБ, АСЛ-О), ЭКГ – 1 раз в 3 месяца в течение первого полугодия, далее – 2 раза в год. Мазок из зева на бета-гемолитический стрептококк группы А – 2 раза в год. ЭхоКГ – 2 раза в год в течение первого года, далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'При отсутствии формирования порока сердца – снятие с учета через 5 лет '},

    {'mkb_key': 'I05.0__I05.1__I05.2__I05.3__I05.4__I05.5__I05.6__I05.7__I05.8__I05.9__I06.0__I06.1__I06.2__I06.3__I06.4__I06.5__I06.6__I06.7__I06.8__I06.9__I07.0__I07.1__I07.2__I07.3__I07.4__I07.5__I07.6__I07.7__I07.8__I07.9__I08.0__I08.1__I08.2__I08.3__I08.4__I08.5__I08.6__I08.7__I08.8__I08.9__I09.0__I09.1__I09.2__I09.3__I09.4__I09.5__I09.6__I09.7__I09.8__I09.9',
     'Наименование заболевания': 'I05–I09 Хронические ревматические болезни сердца ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-невролог, врач-кардиохирург – по медицинским показаниям. ОАК, ОАМ, БАК (СРБ, АСЛ-О), мазок из зева на бета-гемолитический стрептококк группы А, ЭКГ – 2 раза в год. ЭхоКГ – 2 раза в год в течение первого года, далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I10.0__I10.1__I10.2__I10.3__I10.4__I10.5__I10.6__I10.7__I10.8__I10.9',
     'Наименование заболевания': 'I10 Эссенциальная (первичная) гипертензия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-офтальмолог – 1 раз в год. Врач-невролог, врач-нефролог, врач-эндокринолог – по медицинским показаниям. Измерение АД – при каждом посещении. Профиль АД – 4 раза в год. СМАД – при постановке на учет, далее – 1 раз в год. ОАК, ОАМ, БАК (глюкоза, ОХ, ТГ, мочевина, креатинин, общий белок, K, Na, Cl, Mg), ЭхоКГ – 1 раз в год. Анализ мочи по Нечипоренко, УЗИ почек – по медицинским показаниям. ЭКГ – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I15.0__I15.1__I15.2__I15.3__I15.4__I15.5__I15.6__I15.7__I15.8__I15.9',
     'Наименование заболевания': 'I15.0–I15.9 Вторичная гипертензия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-эндокринолог, врач-офтальмолог, врач-нефролог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. Измерение АД – при каждом посещении. Профиль АД – 4 раза в год. СМАД – при постановке на учет, далее – 1 раз в год. ОАМ, ЭКГ – 2 раза в год. Анализ мочи по Нечипоренко – по медицинским показаниям. Анализ мочи по Зимницкому с определением суточной протеинурии – 1 раз в год. БАК (глюкоза, мочевина, креатинин, общий белок, K, Са, Р, Na, Cl, Mg) – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I33.0',
     'Наименование заболевания': 'I33.0 Острый и подострый инфекционный эндокардит (бактериальный, септический) ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 1 раз в месяц первые 3 месяца после выписки, далее – 1 раз в 3 месяца на первом году, в последующем – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-невролог, врач-инфекционист, другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в 3 месяца в первый год заболевания, далее – 1 раз в год и в период интеркуррентных инфекций. БАК (общий белок, АЛТ, ACT, СРБ, K, Na, Cl, Mg) – 2 раза в год на первом году, далее – 1 раз в год. Посевы крови на стерильность, бактериологическое исследование мочи с определением чувствительности к антибиотикам – по медицинским показаниям. ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I34.0,__I34.2__I34.3__I34.4__I34.5__I34.6__I34.7__I34.8__I34.9__I34.1',
     'Наименование заболевания': 'I34.0, I34.2–I34.9 Неревматические поражения митрального клапана I34.1 Пролапс (пролабирование) митрального клапана (II, III степени, I степени с регургитацией II, III степени) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год на первом году, далее – 1 раз в год. Врач-кардиолог/врач-ревматолог – 1 раз в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-кардиохирург – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК (общий белок, K, Na, Cl, Mg, АСЛ-О) – по медицинским показаниям. ЭКГ – 2 раза в год на первом году установления диагноза, далее – 1 раз в год. ЭхоКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I40.0',
     'Наименование заболевания': 'I40.0 Инфекционный миокардит ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 1 раз в месяц первые 3 месяца после выписки, далее – 1 раз в 3 месяца на первом году, в последующем – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. ОАК, ОАМ – 1 раз в 3 месяца на первом году, далее – 1 раз в год и в период интеркуррентных инфекций. БАК (общий белок, ACT, АЛТ, ЛДГ, КФК, К, Na, Cl, Mg, СРБ) – 2 раза в год. ЭКГ – 4 раза в год на первом году, далее – 2 раза в год. ЭхоКГ – 2 раза в год на первом году заболевания, далее – 1 раз в год. R-графия ОГК – по медицинским показаниям. Холтер-ЭКГ (далее – ХМ-ЭКГ) – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 5 лет. Снятие с учета после консультации врача-специалиста областного (городского) уровня '},

    {'mkb_key': 'I42.0',
     'Наименование заболевания': 'I42.0 Дилатационная кардиомиопатия ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в месяц в первом квартале, в следующем квартале – 1 раз в месяц, во 2-м полугодии – ежеквартально, далее – 4 раза в год. Врач-кардиохирург – 1 раз в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. ОАК, ОАМ, БАК (общий белок, СРБ, K, Na, Cl, Mg) – 2 раза в год. Определение МНО крови при назначении антикоагулянтов – еженедельно. Профиль АД – 4 раза в год. ЭКГ, ЭхоКГ с доплером, ХМ-ЭКГ – 2 раза в год. R-графия ОГК (во фронтальной и левой боковой проекции) – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I42.1,__I42.2',
     'Наименование заболевания': 'I42.1, I42.2 Гипертрофическая кардиомиопатия ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в месяц в первом квартале, в следующем квартале – 1 раз в месяц, во 2-м полугодии – ежеквартально, далее – 4 раза в год и при любом интеркуррентном заболевании. Консультация врача-кардиохирурга – 1 раз в год. ОАК, ОАМ, БАК (общий белок, СРБ, K, Na, Cl, Mg) – 2 раза в год. Профиль АД – 4 раза в год. ЭКГ, ЭхоКГ с доплером, ХМ-ЭКГ – 2 раза в год. R-графия ОГК – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I42.4',
     'Наименование заболевания': 'I42.4 Эндокардиальный фиброэластоз ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-кардиохирург – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК (общий белок, СРБ, K, Na, Cl, Mg) – по медицинским показаниям. ЭКГ, ЭхоКГ – 2 раза в год. R-графия ОГК – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I44.0__I44.1',
     'Наименование заболевания': 'I44.0 Предсердно-желудочковая (атриовентрикулярная) блокада I степени I44.1 II степени ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по показаниям. ОАК, ОАМ, ЭхоКГ – 1 раз в год. БАК (общий белок, СРБ, АСЛ-О, АЛТ, ACT, K, Na, Cl, Mg) – по показаниям. ЭКГ – 2 раза в год. Функциональная проба с атропином – по показаниям. ХМ-ЭКГ – при постановке диагноза и перед снятием с учета ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет. При восстановлении функции проводимости '},

    {'mkb_key': 'I44.2',
     'Наименование заболевания': 'I44.2 Предсердно-желудочковая (атриовентрикулярная) блокада полная (III степени) ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-кардиохирург – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК (общий белок, СРБ, АСЛ-О, АЛТ, ACT, K, Na, Cl, Mg) – по показаниям. ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в год. ХМ-ЭКГ – при постановке диагноза, далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I44.4__I44.5__I44.6__I44.7__I45.0,__I45.2,__I45.3',
     'Наименование заболевания': 'I44.4–I44.7 Предсердно-желудочковая (атриовентрикулярная) блокада и блокада левой ножки пучка Гиса I45.0, I45.2, I45.3 Другие нарушения проводимости ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ, ЭКГ – 1 раз в год. ЭхоКГ – 1 раз в 2 года. БАК (общий белок, СРБ, АСЛ-О, АЛТ, ACT, K, Na, Cl, Mg) – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I45.6',
     'Наименование заболевания': 'I45.6 Синдром преждевременного возбуждения ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-кардиохирург – при появлении эпизодов пароксизмальной тахикардии. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ, БАК (общий белок, СРБ, АСЛ-О, АЛТ, ACT, K, Na, Cl, Mg) – 1 раз в год. ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в 2 года. ХМ-ЭКГ – при постановке диагноза, далее – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I45.8',
     'Наименование заболевания': 'I45.8 Другие уточненные нарушения проводимости ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК – по показаниям. ЭКГ – 2 раза в год. ХМ-ЭКГ – по показаниям и перед снятием с учета. ЭхоКГ – 1 раз в 2 года ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I47.1,__I47.2',
     'Наименование заболевания': 'I47.1, I47.2 Пароксизмальная тахикардия ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-кардиохирург – по медицинским показаниям. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК – по медицинским показаниям. ЭКГ – 2 раза в год. ХМ-ЭКГ – при постановке диагноза, далее – 1 раз в год. ЭхоКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I48.0__I48.1__I48.2__I48.3__I48.4__I48.5__I48.6__I48.7__I48.8__I48.9__I49.0',
     'Наименование заболевания': 'I48 Фибрилляция и трепетание предсердий I49.0 Фибрилляция и трепетание желудочков ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-кардиохирург – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК – по медицинским показаниям. ЭКГ – 2 раза в год. ХМ-ЭКГ – 1 раз в год. ЭхоКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'I49.1__I49.2__I49.3__I49.4',
     'Наименование заболевания': 'I49.1–I49.4 Другие нарушения сердечного ритма ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-эндокринолог – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК – по медицинским показаниям. ЭКГ – 2 раза год. ХМ-ЭКГ – при постановке диагноза, далее – 1 раз в год и перед снятием с учета. ЭхоКГ – 1 раз в 2 года ',
     'Сроки наблюдения за пациентом': 'Снятие с учета через 1 год после нормализации ритма сердца '},

    {'mkb_key': 'I49.5',
     'Наименование заболевания': 'I49.5 Синдром слабости синусового узла ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза год. Врач-кардиохирург – 1 раз в год (для решения вопроса об установке искусственного водителя ритма). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. БАК (общий белок, СРБ, АСЛ-О, АЛТ, ACT, К, Na, Cl, Mg) – по медицинским показаниям. ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в год. ХМ-ЭКГ – при постановке диагноза, далее – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M02.3',
     'Наименование заболевания': 'M02.3 Болезнь Рейтера ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-уролог, врач-дерматовенеролог, врач – травматолог-ортопед, врач-офтальмолог – по медицинским показаниям. ОАК, ОАМ – 2 раза в год. БАК (общий белок, мочевина, креатинин, АЛТ, ACT, СРБ, РФ) – 1 раз в год. Обследование на хламидии методом ПЦР и ИФА – по медицинским показаниям. R-графия пораженных суставов – по медицинским показаниям. ЭКГ – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M08.0__M08.1__M08.2__M08.3__M08.4__M08.5__M08.6__M08.7__M08.8__M08.9__M09.0',
     'Наименование заболевания': 'M08.0–М08.9 Юношеский (ювенильный) артрит М09.0 Юношеский артрит при псориазе ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 1 раз в 3 месяца в течение первого года, далее при стойкой ремиссии – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-офтальмолог – 1 раз в год. Врач – травматолог-ортопед, другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в 3 месяца в течение первого года, далее – 2 раза в год. БАК (общий белок, протеинограмма, СРБ, РФ, АЛТ, ACT, мочевина, креатинин) – 2 раза в год. R-графия пораженных суставов – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M30.0__M30.1__M30.2__M30.3__M30.4__M30.5__M30.6__M30.7__M30.8__M30.9',
     'Наименование заболевания': 'M30 Узелковый полиартериит и родственные состояния ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-нефролог – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ, БАК (СРБ, РФ, общий белок, креатинин, АЛТ, ACT, K, Са, Na, Cl), ЭКГ – 2 раза в год. Коагулограмма, УЗИ ОБП, ЭхоКГ – 1 раз в год. R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M32.0__M32.1__M32.2__M32.3__M32.4__M32.5__M32.6__M32.7__M32.8__M32.9',
     'Наименование заболевания': 'M32 Системная красная волчанка ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 4 раза в год в течение первого года, далее – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 2 раза в год. Врач-дерматовенеролог, врач-пульмонолог – по медицинским показаниям. ОАК, БАК (СРБ, РФ, общий белок, мочевина, креатинин, АЛТ, ACT, K, Са, Na, Cl), определение LE-клеток, ОАМ, анализ мочи по Зимницкому с определением суточной протеинурии, ЭКГ – 2 раза в год. УЗИ ОБП, ЭхоКГ – 1 раз в год. Анализ мочи по Нечипоренко, коагулограмма, R-графия ОГК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M33.0__M33.1__M33.2__M33.3__M33.4__M33.5__M33.6__M33.7__M33.8__M33.9',
     'Наименование заболевания': 'M33 Дерматополимиозит ',
     'Сроки и кратность медицинских обследований': 'Врач-ревматолог/врач-кардиолог – 2 раза в год. Врач-оториноларинголог, врач-невролог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ, БАК (СРБ, РФ, общий белок, мочевина, креатинин, ЛДГ, креатинфосфокиназа, АЛТ, ACT, K, Са, Na, Cl), ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в год. УЗИ ОБП, R-графия ОГК, электромиография – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E78.0__E78.1__E78.2__E78.3__E78.4__E78.5__E78.6__E78.7__E78.8__E78.9',
     'Наименование заболевания': 'Е78 Нарушения обмена липопротеидов и другие липидемии ',
     'Сроки и кратность медицинских обследований': 'Врач-кардиолог/врач-ревматолог – 2 раза в год. Врач-генетик, врач-гастроэнтеролог, врач-эндокринолог, врач-нефролог – по медицинским показаниям. Липидограмма (ОХ, ТГ, ЛПВП, ЛПНП, ЛПОНП с определением индекса атерогенности) – 2 раза в год. БАК (амилаза, АЛТ, ACT, глюкоза крови, мочевина, креатинин) – 1 раз в год. ЭКГ, ЭхоКГ, СМАД, УЗИ печени и брахиоцефальных артерий – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E84.0__E84.1__E84.2__E84.3__E84.4__E84.5__E84.6__E84.7__E84.8__E84.9',
     'Наименование заболевания': 'Е84.0–Е84.9 Кистозный фиброз (муковисцидоз) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – дети в возрасте до 1 года – 12 раз в год; дети от 1 года до 2 лет – 6 раз в год, дети старше 2 лет – 4 раза в год. Врач-пульмонолог – 4 раза в год. Врач-оториноларинголог – 2 раза в год. Врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач ЛФК (инструктор по ЛФК) – 4 раза в год. Другие врачи-специалисты – по медицинским показаниям. Измерение массы тела, длины тела, расчет массо-ростового коэффициента – дети до года – 12 раз в год, дети от 1 года до 2 лет – 6 раз в год, дети старше 2 лет – 4 раза в год. ОАК – 4 раза в год. ОАМ – 2 раза в год. Сатурация – 4 раза в год. Копрограмма – 4 раза в год. БАК (общий белок, фракции, билирубин, ACT, АЛТ, мочевина, креатинин, электролиты, щелочная фосфатаза (ЩФ), гамма-глутамилтранспептидаза (ГГТ), глюкоза, СРБ) – 1 раз в год. Иммунограмма – 1 раз в год. Пероральный глюкозотолерантный тест (пациенты, принимающие системные глюкокортикостероиды, и старше 10 лет) – 1 раз в год. Спирометрия – пациентам старше 6 лет с респираторными проявлениями заболевания – 4 раза в год. Микробиологическое исследование мокроты (смывов с верхних дыхательных путей) – 4 раза в год. R-графия ОГК – 1 раз в 2 года. R-графия придаточных пазух носа – 1 раз в год. КТ ОГК – 1 раз в 2 года. УЗИ внутренних органов – 1 раз в год. ЭКГ – 1 раз в год. ЭХО-КГ – 1 раз в год. ФЭГДС – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J47.0__J47.1__J47.2__J47.3__J47.4__J47.5__J47.6__J47.7__J47.8__J47.9__J42.0__J42.1__J42.2__J42.3__J42.4__J42.5__J42.6__J42.7__J42.8__J42.9',
     'Наименование заболевания': 'J47 Бронхоэктатическая болезнь J42 Хронический бронхит неуточненный ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год, по показаниям чаще. Врач-пульмонолог – 2 раз в год, по показаниям чаще. Врач-реабилитолог (врач-физиотерапевт) – 1 раз в год, по показаниям чаще. Другие врачи-специалисты – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – 1 раз в год. ЭКГ – 1 раз в год. Сатурация – 2 раза в год. Спирометрия – пациентам старше 6 лет – 1 раз в год. Эхо-ЭКГ с доплеровским анализом – 1 раз в год. КТ ОГК – 1 раз в 2 года, по медицинским показаниям чаще. Микробиологическое исследование мокроты – 2 раза в год. Иммунограмма, БАК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J40.0__J40.1__J40.2__J40.3__J40.4__J40.5__J40.6__J40.7__J40.8__J40.9',
     'Наименование заболевания': 'J40 Рецидивирующий бронхит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год в течение первого года после последнего обострения, далее – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. Врач-пульмонолог – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК – при каждом обострении, при отсутствии обострений – 2 раза в год. ОАМ – 1 раз в год. БАК – по медицинским показаниям. R-графия ОГК – по медицинским показаниям. Микробиологическое исследование мокроты – по медицинским показаниям. Иммунограмма – по медицинским показаниям. Спирометрия пациентам старше 6 лет – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии обострений в течение 2 лет подряд '},

    {'mkb_key': 'J43.0',
     'Наименование заболевания': 'J43.0 Синдром Мак-Леода ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – в течение первого года болезни – 4 раза в год, далее – 2 раза в год. Врач-пульмонолог – в течение первого года болезни – 4 раза в год, далее – 1 раз в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Другие врачи-специалисты – но медицинским показаниям. ОАК, ОАМ – в течение первого года болезни – 2 раза в год, далее – 1 раз в год. Эхо-ЭКГ с доплеровским анализом – 1 раз в год. R-графия, КТ ОГК – по медицинским показаниям. Спирометрия пациентам старше 6 лет – 1 раз в год. Иммунограмма – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q89.3',
     'Наименование заболевания': 'Q89.3 Situs inversus (первичная цилиарная дискинезия) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год в течение 1-го года после последнего обострения, далее – 2 раза в год. Врач-пульмонолог – 2 раза в год. Врач-оториноларинголог – 4 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – 1 раз в год. ЭКГ – 1 раз в год. Сатурация – 2 раза в год. Спирометрия – пациентам старше 6 лет – 1 раз в год. Эхо-ЭКГ с доплеровским анализом – 1 раз в год. КТ ОГК – 1 раз в 2 года, по медицинским показаниям чаще. R-графия придаточных пазух носа – 1 раз в год. Микробиологическое исследование мокроты – 2 раза в год. Иммунограмма, БАК – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J10.0,__J11.0,__J12.0__J12.1__J12.2__J12.3__J12.4__J12.5__J12.6__J12.7__J12.8__J12.9__J13.0__J13.1__J13.2__J13.3__J13.4__J13.5__J13.6__J13.7__J13.8__J13.9__J14.0__J14.1__J14.2__J14.3__J14.4__J14.5__J14.6__J14.7__J14.8__J14.9__J15.0__J15.1__J15.2__J15.3__J15.4__J15.5__J15.6__J15.7__J15.8__J15.9__J16.0__J16.1__J16.2__J16.3__J16.4__J16.5__J16.6__J16.7__J16.8__J16.9__J17.0__J17.1__J17.2__J17.3__J17.4__J17.5__J17.6__J17.7__J17.8__J17.9__J18.0__J18.1__J18.2__J18.3__J18.4__J18.5__J18.6__J18.7__J18.8__J18.9',
     'Наименование заболевания': 'J10.0, J11.0, J12, J13–J18 Пневмония ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – дети, перенесшие острую пневмонию: в возрасте первых 3 месяцев жизни – первые 6 месяцев – 2 раза в месяц, далее – 1 раз в месяц; в возрасте 3–12 месяцев – 1 раз в месяц; в возрасте от 1 года до 3 лет – 1 раз в 2 месяца; в возрасте старше 3 лет – 4 раза в год. Другие врачи-специалисты – по медицинским показаниям. ОАК – 2 раза в год. R-графия ОГК – по медицинским показаниям. Спирометрия пациентам старше 5 лет – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 1 год при клиническом и рентгенологическом выздоровлении '},

    {'mkb_key': 'J67.0__J67.1__J67.2__J67.3__J67.4__J67.5__J67.6__J67.7__J67.8__J67.9',
     'Наименование заболевания': 'J67.0–J67.9 Гиперсенситивный пневмонит, вызванный органической пылью (гиперчувствительный пневмонит) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): в первые 3 месяца наблюдения – 1 раз в месяц, далее до года – 4 раза в год, после года наблюдения – 2 раза в год. Врач-пульмонолог – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 2 раза в год. БАК – по медицинским показаниям. Иммунограмма – 1 раз в год. Определение аллергенспецифических IgE-антител – по медицинским показаниям. Спирометрия пациентам старше 6 лет – 1 раз в год. ЭКГ, ЭХО-КГ – 1 раз в год. КТ ОГК – 1 раз в 2 года, по медицинским показаниям чаще ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 2 года после клинико-лабораторного выздоровления или ремиссии '},

    {'mkb_key': 'J68.0',
     'Наименование заболевания': 'J68.0 Бронхит и пневмонит, вызванный химическими веществами, газами, дымами и парами ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): в первые 3 месяца – 1 раз в месяц, далее до года – 4 раза в год, после года наблюдения – 2 раза в год. Врач-пульмонолог – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 2 раза в год. БАК – по медицинским показаниям. Иммунограмма – 1 раз в год. Определение аллергенспецифических IgE-антител – по медицинским показаниям. Спирометрия пациентам старше 5 лет – 1 раз в год. ЭКГ, ЭХО-КГ – 1 раз в год. КТ ОГК – 1 раз в 2 года, по медицинским показаниям чаще ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 2 года после клинико-лабораторного выздоровления или ремиссии '},

    {'mkb_key': 'J70.0__J70.1__J70.2__J70.3__J70.4__J70.5__J70.6__J70.7__J70.8__J70.9',
     'Наименование заболевания': 'J70.0–J70.9 Респираторные состояния, вызванные другими внешними агентами (токсические и лекарственные пневмониты) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): в первые 3 месяца – 1 раз в месяц, далее до года – 4 раза в год, после года наблюдения – 2 раза в год. Врач-пульмонолог – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 2 раза в год. БАК – по медицинским показаниям. Иммунограмма – 1 раз в год. Определение аллергенспецифических IgE-антител – по медицинским показаниям. Спирометрия пациентам старше 5 лет – 1 раз в год. ЭКГ, ЭХО-КГ – 1 раз в год. КТ ОГК – 1 раз в 2 года, по медицинским показаниям чаще ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 2 года после клинико-лабораторного выздоровления или ремиссии '},

    {'mkb_key': 'Q32.0__Q32.1__Q32.2__Q32.3__Q32.4__Q33.0__Q33.1__Q33.2__Q33.3__Q33.4__Q33.5__Q33.6__Q33.8__Q33.9__Q34.0,__Q34.9',
     'Наименование заболевания': 'Q32.0–Q32.4, Q33.0–Q33.6, Q33.8–Q33.9 Врожденные аномалии трахеи и бронхов, легкого Q34.0, Q34.9 Другие врожденные аномалии (пороки развития) органов дыхания ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): дети до года – 12 раз в год, дети от 1 года до 2 лет – 6 раз в год, дети старше 2 лет – 2 раза в год. Врач-пульмонолог – 2 раза в год. Врач – торакальный хирург – при постановке на учет, далее – по медицинским показаниям. Другие врачи-специалисты – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – 1 раз в год. ЭКГ – 1 раз в год. Спирометрия пациентам старше 5 лет – 1 раз в год. R-графия, КТ ОГК – по медицинским показаниям. ЭХО-КГ – по медицинским показаниям. БАК, иммунограмма – по медицинским показаниям. Микробиологическое исследование мокроты – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Р27.1__J43.0__J43.1__J43.2__J43.3__J43.4__J43.5__J43.6__J43.7__J43.8__J43.9',
     'Наименование заболевания': 'Р27.1 (от 0 до 1 года), J43 (1–3 года) Бронхолегочная дисплазия, возникшая в перинатальном периоде ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): на первом году жизни – ежемесячно; в возрасте от 1 года до 3 лет – 2 раза в год. Врач-пульмонолог – при легкой степени тяжести на первом году жизни – 2 раза в год, в возрасте от 1 года до 3 лет – по медицинским показаниям. При среднетяжелой/тяжелой степени тяжести: на первом году жизни – ежеквартально, в возрасте от 1 года до 3 лет – 2 раза в год. Врач-оториноларинголог – 1 раз в год. Измерение массы и длины тела, расчет массо-ростового коэффициента – при каждом посещении врача-педиатра участкового (врача-педиатра, врача общей практики). ОАК – 2 раза в год. ОАМ – 1 раз в год. Пульсоксиметрия, определение газов крови – по медицинским показаниям. R-графия ОГК – не реже 1 раза в год. КТ ОГК – по медицинским показаниям. ЭКГ – 2 раза в год. ЭХО-КГ с определением давления в легочной артерии – 2 раза в год. Иммунограмма – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Наблюдение до 3-летнего возраста. Необходимость дальнейшего наблюдения устанавливается индивидуально в зависимости от исходов заболевания '},

    {'mkb_key': 'I27.0',
     'Наименование заболевания': 'I27.0 Первичная легочная гипертензия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-пульмонолог, врач-кардиолог – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – 1 раз в год. БАК – по медицинским показаниям. R-графия ОГК – 1 раз в год. КТ ОГК – по медицинским показаниям. ЭКГ – 2 раза в год. ЭХО-КГ с определением давления в легочной артерии – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'J45.0__J45.1__J45.2__J45.3__J45.4__J45.5__J45.6__J45.7__J45.8__J45.9',
     'Наименование заболевания': 'J45.0–J45.9 Астма ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-реабилитолог – 1 раз в год. Врач-аллерголог – 1 раз в год. Врач-иммунолог, другие врачи-специалисты – по медицинским показаниям. Кожные аллергологические пробы, определение аллергенспецифических IgE-антител, иммунограмма – по назначению врача-аллерголога. Спирометрия – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'В течение 5 лет после наступления спонтанной ремиссии, снятие с учета – после консультации врача-аллерголога '},

    {'mkb_key': 'L20.0__L20.1__L20.2__L20.3__L20.4__L20.5__L20.6__L20.7__L20.8__L20.9',
     'Наименование заболевания': 'L20.0–L20.9 Атопический дерматит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-дерматовенеролог – при тяжелом течении – 1 раз в год. Врач-гастроэнтеролог – по медицинским показаниям. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач-аллерголог – 1 раз в год. Врач-иммунолог, другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. Определение аллергенспецифических IgE-антител – по назначению врача-аллерголога. Копрограмма, анализ кала на яйца глистов и исследование на энтеробиоз – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'В течение не менее 3 лет после наступления ремиссии '},

    {'mkb_key': 'J30.1__J30.2__J30.3__J30.4',
     'Наименование заболевания': 'J30.1–J30.4 Вазомоторный и аллергический ринит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-оториноларинголог – 2 раза в год. Врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач-аллерголог – 1 раз в год. Врач-офтальмолог – 1 раз в год. Врач-иммунолог, другие врачи-специалисты – по медицинским показаниям. ОАК – 1 раз в год. Кожные аллергологические пробы, определение аллергенспецифических IgE-антител – по назначению врача-аллерголога. Риноцитограмма – 1 раз в год. R-графия придаточных пазух носа – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'В течение не менее 3 лет после последнего обострения. Снятие с учета – после консультации врача-аллерголога '},

    {'mkb_key': 'L50.0',
     'Наименование заболевания': 'L50.0 Аллергическая крапивница (хроническая) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-аллерголог, врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач-гастроэнтеролог, врач-иммунолог, другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. Определение аллергенспецифических IgE-антител – по назначению врача-аллерголога. БАК – по медицинским показаниям. Анализ кала на яйца глистов и исследование на энтеробиоз – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'В течение не менее 3 лет после последнего обострения. Снятие с учета – после консультации врача-аллерголога '},

    {'mkb_key': 'Т63.4__Т78.0__Т78.2__Т80.5__Т88.6__L51.1,__L51.2__L27.0__L27.1__L27.2__L27.3__L27.4__L27.5__L27.6__L27.7__L27.8__L27.9',
     'Наименование заболевания': 'Т63.4 Токсический эффект, обусловленный контактом с ядовитыми животными (острые аллергические реакции; анафилаксия (анафилактический шок) Т78.0 Анафилактический шок, вызванный патологической реакцией на пищу Т78.2 Анафилактический шок, неуточненный Т80.5 Анафилактический шок, связанный с введением сыворотки Т88.6 Анафилактический шок, обусловленный патологической реакцией на неадекватно назначенное и правильно примененное лекарственное средство L51.1, L51.2 Эритема многоформная L27 Дерматит, вызванный веществами, принятыми внутрь ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 2 раза в год. При анафилаксии – осмотр врачом-офтальмологом и врачом-неврологом – 4 раза в год. При синдроме Стивенса-Джонсона – токсическом эпидермальном некролизе – осмотр врачом-офтальмологом и врачом-дерматовенерологом – 2 раза в год. ОАК, ОАМ – 2 раза в год. БАК (мочевина, креатинин, АЛТ, ACT, билирубин, общий белок) – по показаниям ',
     'Сроки наблюдения за пациентом': 'В течение 6 месяцев с момента выздоровления '},

    {'mkb_key': 'K29.0__K29.1__K29.2__K29.3__K29.4__K29.5__K29.6__K29.7__K29.8__K29.9__K29.3,__K29.5,__K29.6,__K29.8,__K29.9',
     'Наименование заболевания': 'K29 K29.3, K29.5, K29.6, K29.8, K29.9 Гастрит и дуоденит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза год. Другие врачи-специалисты – по медицинским показаниям. ОАК, ОАМ – 1 раз в год. УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям. При хеликобактерном гастрите контроль эффективности эрадикации через 4–8 недель после окончания антихеликобактерной терапии: повторная ЭГДС (анализ кала на антиген H.Pylori или дыхательный тест на H.Pylori). При гастритах, не ассоциированных с хеликобактером, ЭГДС – по медицинским показаниям и при снятии с учета ',
     'Сроки наблюдения за пациентом': 'В течение 2 лет. Снятие с учета – при стойкой ремиссии и отсутствии морфологических и эндоскопических признаков активного воспалительного процесса '},

    {'mkb_key': 'K29.4',
     'Наименование заболевания': 'K29.4 Хронический атрофический гастрит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог – при установлении диагноза, далее – 1 раз в год. Другие врачи-специалисты – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ – 1 раз в год. БАК (общий белок, протеинограмма, билирубин с фракциями, ACT, АЛТ, амилаза, ЩФ, СРБ, глюкоза, ОХ, ферритин) – 1 раз в год. УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K25.0__K25.1__K25.2__K25.3__K25.4__K25.5__K25.6__K25.7__K25.8__K25.9__K26.0__K26.1__K26.2__K26.3__K26.4__K26.5__K26.6__K26.7__K26.8__K26.9',
     'Наименование заболевания': 'K25 Язва желудка (эрозия (острая) желудка) K26 Язва двенадцатиперстной кишки (эрозия (острая) двенадцатиперстной кишки) ',
     'Сроки и кратность медицинских обследований': 'Неосложненная язва Врач-педиатр участковый (врач-педиатр, врач общей практики) – через 4–6 недель после выявления язвы, далее – 2 раза в год. Врач-гастроэнтеролог – 1 раз в год. Осложненная язва Врач-педиатр участковый (врач-педиатр, врач общей практики) – через 4 недели после выявления язвы, далее – 3 раза в год. Врач-гастроэнтеролог – 1 раз в год. Врач – детский хирург (врач-хирург) – по медицинским показаниям. ОАК, копрограмма – 2 раза в год. УЗИ ОБП – 1 раз в год. ЭГДС с биопсией – через 4–6 недель после установления диагноза (контроль заживления язвы и эффективности антихеликобактерной эрадикационной терапии); далее – по медицинским показаниям и при снятии с учета. БАК (общий белок, билирубин с фракциями, OX, ACT, АЛТ, амилаза, ЩФ, СРБ, ферритин, глюкоза) – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при наличии стойкой ремиссии в течение 3 лет и отсутствии морфологических и эндоскопических признаков активности заболевания. Осложненная язва – с учета не снимать '},

    {'mkb_key': 'K81.1',
     'Наименование заболевания': 'K81.1 Хронический холецистит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог – 1 раз в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач – детский хирург (врач-хирург) – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма, УЗИ ОБП с определением функции желчного пузыря – 2 раза в год. БАК (общий белок, билирубин с фракциями, OX, ACT, АЛТ, амилаза, ЩФ, СРБ, АСЛ-О, глюкоза), диастаза мочи – 1 раз в год. ЭГДС – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии изменений по данным медицинского осмотра и изменений по данным лабораторно-инструментальных методов в течение 2 лет '},

    {'mkb_key': 'K80.0__K80.1__K80.2__K80.3__K80.4__K80.5__K80.6__K80.7__K80.8',
     'Наименование заболевания': 'K80.0–K80.8 Желчнокаменная болезнь (холелитиаз) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог – 2 раза в год. Врач – детский хирург (врач-хирург) – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма – 2 раза в год. УЗИ ОБП – 2 раза в год. БАК (общий белок, протеинограмма, билирубин с фракциями, ACT, АЛТ, амилаза, ЩФ, СРБ, глюкоза, ОХ, ферритин), диастаза мочи – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K86.1',
     'Наименование заболевания': 'K86.1 Другие хронические панкреатиты ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог – 2 раза в год. Врач – детский хирург (врач-хирург), врач-эндокринолог, врач-генетик, врач-иммунолог – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма – 2 раза в год. УЗИ ОБП – 2 раза в год. УЗ-доплерография сосудов системы воротной вены – 1 раз в год. БАК (общий белок, протеинограмма, билирубин с фракциями, ACT, АЛТ, амилаза, ЩФ, СРБ, глюкоза, ОХ, ферритин), диастаза мочи – 1 раз в год. Пероральный глюкозотолерантный тест – 1 раз в год. ЭГДС – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K51.0__K51.1__K51.2__K51.3__K51.4__K51.5__K51.6__K51.7__K51.8__K51.9__K50.0__K50.1__K50.2__K50.3__K50.4__K50.5__K50.6__K50.7__K50.8__K50.9',
     'Наименование заболевания': 'K51.0–K51.9 Язвенный колит K50.0–K50.9 Болезнь Крона ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – при установления диагноза и при рецидиве 1 раз в месяц, в ремиссии первые 6 месяцев – 1 раз в 3 месяца, далее – 2 раза в год. Врач-гастроэнтеролог – 4 раза в год в первый год после установления диагноза или при рецидиве, далее – 2 раза в год. Врач – детский хирург (врач-хирург), врач-психотерапевт, врач-фтизиатр – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма, БАК (общий белок, протеинограмма, СРБ, Са, Р, ЩФ, ACT, АЛТ, мочевина, глюкоза, ферритин) – ежемесячно до выхода в ремиссию, в ремиссии – 2 раза в год. УЗИ ОБП – 2 раза в год. ЭГДС, колоноскопия – по медицинским показаниям. Исследование кала на дисбактериоз, посев кала на ПКФ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K90.0',
     'Наименование заболевания': 'K90.0 Целиакия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – в первый год после установления диагноза – 4 раза в год, далее – 2 раза в год. Врач-гастроэнтеролог – 2 раза в год до выхода в ремиссию, далее – 1 раз в год. Врач-иммунолог, врач-аллерголог, врач-невролог, врач-эндокринолог – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма, УЗИ ОБП – 1 раз в год. БАК (общий белок, протеинограмма, СРБ, Са, Р, ЩФ, ACT, АЛТ, мочевина, глюкоза, a-амилаза, ОХ, ферритин, сывороточное железо) – 1 раз в год. Гормоны щитовидной железы (Т3, Т4), ТТГ, АТПО – 1 раз в год. ЭГДС – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K21.0__K22.1',
     'Наименование заболевания': 'K21.0 Гастроэзофагеальный рефлюкс K22.1 Язва пищевода ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог – 2 раза в год. Врач – детский хирург (врач-хирург), врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма, УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям и при снятии с учета. ФВД – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 3 года при отсутствии изменений по данным медицинского осмотра и лабораторно-инструментальных методов '},

    {'mkb_key': 'E40.0__E40.1__E40.2__E40.3__E40.4__E40.5__E40.6__E40.7__E40.8__E40.9__E41.0__E41.1__E41.2__E41.3__E41.4__E41.5__E41.6__E41.7__E41.8__E41.9__E42.0__E42.1__E42.2__E42.3__E42.4__E42.5__E42.6__E42.7__E42.8__E42.9__E43.0__E43.1__E43.2__E43.3__E43.4__E43.5__E43.6__E43.7__E43.8__E43.9__E44.0__E44.1__E44.2__E44.3__E44.4__E44.5__E44.6__E44.7__E44.8__E44.9__E45.0__E45.1__E45.2__E45.3__E45.4__E45.5__E45.6__E45.7__E45.8__E45.9__E46.0__E46.1__E46.2__E46.3__E46.4__E46.5__E46.6__E46.7__E46.8__E46.9',
     'Наименование заболевания': 'Е40–Е46 Недостаточность питания ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-гастроэнтеролог, врач-генетик, врач-эндокринолог, врач-невролог, врач – психиатр-нарколог, другие врачи-специалисты – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, ОАМ, копрограмма – 2 раза в год. БАК (общий белок, глюкоза, АЛТ, ACT, билирубин, ЩФ, ГГТП, a-амилаза, белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма – 1 раз в год. Иммунограмма – по медицинским показаниям. УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Е40–Е43, Е45 – с учета не снимать. Е44, Е46 – снятие с учета по заключению врача-гастроэнтеролога и врача-эндокринолога '},

    {'mkb_key': 'K71.0,__K71.2__K71.3__K71.4__K71.5__K71.6__K71.8__K71.9',
     'Наименование заболевания': 'K71.0, K71.2–K71.6, K71.8–K71.9 Токсическое поражение печени ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – после установления диагноза, при рецидиве – 1 раз в месяц до выхода в ремиссию, в ремиссии – 2 раза в год. Врач-гастроэнтеролог – 4 раза в год в первый год после установления диагноза или при рецидиве, далее – по медицинским показаниям. Оценка физического развития – 2 раза в год. При каждой явке до выхода в ремиссию: ОАК, МНО, БАК (общий белок, глюкоза, АЛТ, ACT, билирубин, тимоловая проба, ЩФ, ГГТП, a-амилаза, белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма – по медицинским показаниям. В ремиссии: ОАК, МНО, БАК (общий белок, глюкоза, АЛТ, ACT, билирубин, тимоловая проба, ЩФ, ГГТП, a-амилаза, белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма – 1 раз в год. УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям. Исследование на HBsAg, анти-HCV – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K73.0__K73.1__K73.2__K73.3__K73.4__K73.5__K73.6__K73.7__K73.8__K73.9__K76.0__K76.1__K76.2__K76.3__K76.4__K76.5__K76.6__K76.7__K76.8__K76.9',
     'Наименование заболевания': 'K73.0–K73.9 Хронический гепатит, не классифицированный в других рубриках K76.0–K76.9 Другие болезни печени ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – после установления диагноза, при рецидиве – 1 раз в месяц до выхода в ремиссию, в ремиссии – 2 раза в год. Врач-гастроэнтеролог – 4 раза в год в первый год после установления диагноза или при рецидиве, далее – по медицинским показаниям. Врач-инфекционист, другие врачи-специалисты – по медицинским показаниям. Оценка физического развития – 2 раза в год. При каждой явке до выхода в ремиссию: ОАК, МНО, БАК (общий белок, глюкоза, АЛТ, ACT, билирубин, тимоловая проба, ЩФ, ГГТП). БАК (a-амилаза, белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма – по медицинским показаниям. В ремиссии: ОАК, МНО, БАК (общий белок, глюкоза, АЛТ, ACT, билирубин, тимоловая проба, ЩФ, ГГТП); БАК (a-амилаза, белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма – 1 раз в год. УЗИ ОБП – 1 раз в год. ЭГДС – по медицинским показаниям. УЗИ ОБП и УЗДГ сосудов системы воротной вены – 2 раза в год. Исследование на HBsAg, анти-HCV – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'E83.0',
     'Наименование заболевания': 'Е83.0 Нарушение обмена меди ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-гастроэнтеролог и/или врач-инфекционист, врач-офтальмолог – 2 раза в год. Врач – детский хирург (врач-хирург), другие врачи-специалисты – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, МНО – 2 раза в год. БАК (АЛТ, ACT, билирубин, тимоловая проба, церулоплазмин) – 2 раза в год. БАК (ГГТП, ЩФ, глюкоза, a-амилаза, общий белок и белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП), коагулограмма, пероральный глюкозотолерантный тест – по медицинским показаниям. УЗИ ОБП и УЗДГ сосудов системы воротной вены – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K74.0__K74.1__K74.2__K74.3__K74.4__K74.5__K74.6__K71.1__K71.7',
     'Наименование заболевания': 'K74.0–K74.6 Фиброз и цирроз печени K71.1 Токсическое поражение печени с печеночным некрозом K71.7 Токсическое поражение печени с фиброзом и циррозом печени ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики): дети старше 3 лет (в том числе с циррозом печени классов А и В по Child) – 2 раза в год, дети первых 3 лет и дети с циррозом класса С по Child – 4 раза в год или чаще исходя из балла MELD/PELD (&lt;18 баллов – 1 раз в 3 месяца, 18–24 балла – 1 раз в месяц, &gt;25 баллов – 1 раз в 2 недели). Врач-гастроэнтеролог, врач-невролог – 2 раза в год. Врач – детский хирург (врач-хирург), другие врачи-специалисты – по медицинским показаниям. Врач-трансплантолог – при прогнозируемой низкой 3-месячной выживаемости (балл MELD/PELD &lt;20). Дополнительно (при циррозе, ассоциированном с вирусами гепатитов В и С) – врач-инфекционист областного уровня (г. Минск – диспансерный кабинет УЗ «ГДИКБ») – 2 раза в год. Оценка физического развития – 2 раза в год. ОАК, МНО – 4 раза в год. БАК (АЛТ, ACT, билирубин, тимоловая проба, ГГТП, ЩФ, глюкоза, a-амилаза, общий белок и белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП, K, Са, Na, Cl), коагулограмма, пероральный глюкозотолерантный тест – 2 раза в год. a-фетопротеин – 2 раза в год. УЗИ ОБП и УЗДГ сосудов системы воротной вены – 2 раза в год. Исследование HBsAg, анти-HCV – первично и далее – по медицинским показаниям. КТ брюшной полости, холангиография, спленопортография – по показаниям. Пункционная биопсия печени – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K72.0__K72.1__K72.2__K72.3__K72.4__K72.5__K72.6__K72.7__K72.8__K72.9',
     'Наименование заболевания': 'K72.0–K72.9 Печеночная недостаточность, не классифицируемая в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Аналогично K74. Врач – психиатр-нарколог – по медицинским показаниям. Оценка физического развития – 2 раза в год. ОАК, МНО – 4 раза в год. БАК (АЛТ, ACT, билирубин, тимоловая проба, ГГТП, ЩФ, глюкоза, a-амилаза, общий белок и белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП, K, Са, Na, Cl), коагулограмма, пероральный глюкозотолерантный тест – 2 раза в год. a-фетопротеин – 2 раза в год. УЗИ ОБП и УЗДГ сосудов системы воротной вены – 2 раза в год. Исследование HBsAg, анти-HCV – первично и далее – по медицинским показаниям. КТ брюшной полости, холангиография, спленопортография – по показаниям. Пункционная биопсия печени – по медицинским показаниям. Психометрические тесты – при каждом медицинском осмотре. Аммиак крови, ЭЭГ – по медицинским показаниям ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'K76.6',
     'Наименование заболевания': 'K76.6 Портальная гипертензия ',
     'Сроки и кратность медицинских обследований': 'Аналогично К74. Врач – детский хирург (врач-хирург) – 2 раза в год. Оценка физического развития – 2 раза в год. ОАК, МНО – 4 раза в год. БАК (АЛТ, ACT, билирубин, тимоловая проба, ГГТП, ЩФ, глюкоза, a-амилаза, общий белок и белковые фракции, ОХ, ТГ, ЛПВП, ЛПНП, K, Са, Na, Cl), коагулограмма, пероральный глюкозотолерантный тест – 2 раза в год. a-фетопротеин – 2 раза в год. УЗИ ОБП и УЗДГ сосудов системы воротной вены – 2 раза в год. Исследование HBsAg, анти-HCV – первично и далее – по медицинским показаниям. КТ брюшной полости, холангиография, спленопортография – по показаниям. Пункционная биопсия печени – по медицинским показаниям. Психометрические тесты – при каждом медицинском осмотре. Аммиак крови, ЭЭГ – по медицинским показаниям. ЭГДС – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N00.0__N00.1__N00.2__N00.3__N00.4__N00.5__N00.6__N00.7__N00.8__N00.9',
     'Наименование заболевания': 'N00 Острый нефритический синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев – 1 раз в месяц, далее – 4 раза в год. Врач-нефролог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – 2 раза в год. ОАМ – первые 6 месяцев наблюдения – 2 раза в месяц, далее – 1 раз в месяц, в случае стойкой ремиссии в течение года – 4 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. БАК (мочевина, креатинин, ОХ, общий белок, K, Na, Са, Р, Cl, АСЛ-О, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. Профиль АД – 4 раза в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии обострений и сохранной функции почек в течение 5 лет '},

    {'mkb_key': 'N01.0__N01.1__N01.2__N01.3__N01.4__N01.5__N01.6__N01.7__N01.8__N01.9',
     'Наименование заболевания': 'N01 Быстро прогрессирующий нефритический синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев после активных проявлений – 1 раз в месяц; далее – 4 раза в год. Врач-нефролог – 4 раза в год в первый год наблюдения после установления диагноза или обострения, далее – 2 раза в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК в первый год – 1 раз в 3 месяца, далее – 2 раза в год (при иммуносупрессивной терапии – 1 раз в неделю). ОАМ – первые 6 месяцев наблюдения – 2 раза в месяц, далее – 1 раз в месяц, при стойкой ремиссии в течение года – 4 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. БАК (мочевина, креатинин, ОХ, общий белок, K, Na, Са, Р, Cl, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. Профиль АД – 4 раза в год. СМАД – по медицинским показаниям. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N02.0__N02.1__N02.2__N02.3__N02.4__N02.5__N02.6__N02.7__N02.8__N02.9',
     'Наименование заболевания': 'N02 Рецидивирующая и устойчивая гематурия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев после активных проявлений – 1 раз в месяц; далее – 4 раза в год. Врач-нефролог – 2 раза в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог, врач – акушер-гинеколог – 1 раз год. Врач-уролог – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – первые 6 месяцев после активных проявлений – 1 раз в месяц, при стойкой ремиссии в течение года – 4 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. БАК (мочевина, креатинин, ОХ, общий белок, K, Na, Са, Р, Cl, АСЛ-О, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. Бактериологическое исследование мочи на микобактерии туберкулеза трехкратно – 1 раз в год. Профиль АД – 4 раза в год. СМАД – по медицинским показаниям. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии обострений и сохранной функции почек в течение 5 лет либо с учетом данных нефробиопсии '},

    {'mkb_key': 'N03.0__N03.1__N03.2__N03.3__N03.4__N03.5__N03.6__N03.7__N03.8__N03.9',
     'Наименование заболевания': 'N03 Хронический нефритический синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев после активных проявлений – 1 раз в месяц; далее – 4 раза в год. Врач-нефролог – 2 раза в год в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – 2 раза в год. ОАМ – 6 месяцев после активных проявлений – 2 раза в месяц, далее – 1 раз в месяц, в случае стойкой ремиссии в течение года – 4 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. БАК (мочевина, креатинин, ОХ, общий белок, K, Na, Са, Р, Cl, АСЛ-О, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. Профиль АД – 4 раза в год. СМАД – по медицинским показаниям. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N04.0__N04.1__N04.2__N04.3__N04.4__N04.5__N04.6__N04.7__N04.8__N04.9',
     'Наименование заболевания': 'N04 Нефротический синдром ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 6 месяцев после активных проявлений – 1 раз в месяц; далее – 4 раза в год. Врач-нефролог – 2 раза в год в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – первые 6 месяцев после активных проявлений – 1 раз в месяц, далее – 2 раза в год. ОАМ – первые 6 месяцев после активных проявлений – 2 раза в месяц, далее – 1 раз в месяц, при стойкой ремиссии в течение года – 4 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – первые 6 месяцев после рецидива – 1 раз в 3 месяца, далее – 2 раза в год. БАК (мочевина, креатинин, ОХ, общий белок, K, Na, Са, Cl, Р, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N06.0__N06.1__N06.2__N06.3__N06.4__N06.5__N06.6__N06.7__N06.8__N06.9',
     'Наименование заболевания': 'N06 Изолированная протеинурия с уточненным морфологическим поражением (протеинурия (изолированная) (ортостатическая) (стойкая) с морфологическим поражением, уточненным) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год, при стойкой ремиссии – 2 раза в год. Врач-нефролог – 2 раза в год в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год, по медицинским показаниям – чаще (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – 2 раза в год. ОАМ – первые 6 месяцев после активных проявлений – 2 раза в месяц, далее – 1 раз в месяц, далее – 4 раза в год, при стойкой ремиссии – 2 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. БАК (мочевина, креатинин, общий белок, K, Na, Са, Р, Cl, АСЛ-О, СРБ), клиренс по эндогенному креатинину – 2 раза в год, далее – 1 раз в год. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N07.0__N07.1__N07.2__N07.3__N07.4__N07.5__N07.6__N07.7__N07.8__N07.9',
     'Наименование заболевания': 'N07 Наследственная нефропатия, не классифицированная в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-нефролог – 2 раза в год в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год (при отсутствии – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – 2 раза в год. ОАМ – 4 раза в год. Анализ мочи по Зимницкому – 2 раза в год с определением суточной протеинурии. БАК (мочевина, креатинин, общий белок, K, Na, Са, Р, Cl, СРБ) – 2 раза в год. УЗИ почек – 1 раз в год. Аудиометрия – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N10.0__N10.1__N10.2__N10.3__N10.4__N10.5__N10.6__N10.7__N10.8__N10.9',
     'Наименование заболевания': 'N10 Острый тубулоинтерстициальный нефрит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 3 месяца 1 раз в месяц, далее – 1 раз в 3 месяца, со второго года наблюдения – 2 раза в год. Врач-нефролог в первый год после установления диагноза или обострения – 2 раза в год, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-уролог – 1 раз в год. Врач – акушер-гинеколог – по медицинским показаниям. ОАК – 1 раз в 3 месяца, далее – 2 раза в год. ОАМ – первые 6 месяцев: первый месяц – 1 раз в 10 дней, далее – 1 раз в месяц, второе полугодие – 1 раз в 3 месяца; со второго года наблюдения – 2 раза в год. БАК (мочевина, креатинин, глюкоза, общий белок, K, Na, Са, Cl, СРБ) – 1 раз в год. Клиренс по эндогенному креатинину – 1 раз в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – через 3 недели по окончании антибактериальной терапии – трехкратно с интервалом 3–6 недель, далее – по медицинским показаниям. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. Анализ мочи по Зимницкому – 1 раз в год. УЗИ почек, мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при полной клинико-лабораторной ремиссии в течение 3 лет '},

    {'mkb_key': 'N11.0__N11.1__N11.2__N11.3__N11.4__N11.5__N11.6__N11.7__N11.8__N11.9',
     'Наименование заболевания': 'N11.0–N11.9 Хронический тубулоинтерстициальный нефрит ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – первые 3 месяца – 1 раз в месяц, далее – 4 раза в год. Врач-нефролог – 2 раза в год в первый год после установления диагноза или обострения, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-уролог – 1 раз в год. Врач – акушер-гинеколог – по медицинским показаниям. ОАК – 4 раза в год, далее – 2 раза в год. ОАМ – первый год наблюдения: в первый месяц – 1 раз в 10 дней, далее – 1 раз в месяц первые 3 месяца, далее – 4 раза в год. БАК (мочевина, креатинин, глюкоза, общий белок, K, Na, Са, Cl, СРБ) – 1 раз в год. Клиренс по эндогенному креатинину – 1 раз в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – через 3 недели по окончании антибактериальной терапии – трехкратно с интервалом 3–6 недель, далее – по медицинским показаниям. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. Анализ мочи по Зимницкому – 1 раз в год. УЗИ почек, мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N17.0,__N17.1,__N17.2',
     'Наименование заболевания': 'N17.0, N17.1, N17.2 Острая почечная недостаточность ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) в первые 3 месяца – 1 раз в месяц, далее – 4 раза в год. Врач-нефролог – 4 раза в первый год наблюдения после установления диагноза или обострения, далее – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз в год. ОАК: первые 6 месяцев – 1 раз в квартал, далее – 2 раза в год. ОАМ: первые 6 месяцев – 2 раза в месяц, далее – 1 раз в месяц; на втором году и далее – 4 раза в год. Проба по Зимницкому первые 6 месяцев – 1 раз в 3 месяца, далее – 2 раза в год. БАК (мочевина, креатинин, общий белок, ОХ, K, Са, Р, Na, Cl) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – через 3 года при сохранной почечной функции '},

    {'mkb_key': 'N18.0,__N18.2,__N18.3,__N18.8',
     'Наименование заболевания': 'N18.0, N18.2, N18.3, N18.8 Хроническая почечная недостаточность ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 12 раз в год. Врач-нефролог – 4 раза в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – не реже 1 раза в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз в год. ОАМ (при наличии мочи), ОАК – 12 раз в год. БАК (мочевина, креатинин, общий белок, Са, Р, K, Na, Cl, ЩФ, сывороточное железо), клиренс по эндогенному креатинину – 4 раза в год. Определение уровня ПТГ в крови – 2 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 4 раза в год. Коагулограмма – 4 раза в год. Исследование показателей КЩС – 4 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – 2 раза в год. Бактериологическое исследование мочи на микобактерии туберкулеза – 2 раза в год. Профиль АД – 2 раза в год. ЭКГ – 2 раза в год. ЭхоКГ – 1 раз в год. УЗИ почек – 2 раза в год. При развитии терминальной ХПН – обследование по назначению врача-нефролога ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N25.0',
     'Наименование заболевания': 'N25.0 Почечная остеодистрофия ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-нефролог – 2 раза в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач – травматолог-ортопед, врач-офтальмолог, врач-эндокринолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. ОАК – 2 раза в год. ОАМ – 4 раза в год. Суточная экскреция Са, Р с мочой – 1 раз в год. БАК (мочевина, креатинин, общий белок, ОХ, K, Na, Са, Р, Cl, ЩФ, глюкоза), клиренс по эндогенному креатинину – 1 раз в месяц до нормализации показателей, далее – 2 раза в год. Исследование показателей КЩС – 1 раз в год. Уровень ПТГ – 1 раз в год. Денситометрия – 1 раз в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N25.1__N25.8',
     'Наименование заболевания': 'N25.1 Нефрогенный несахарный диабет N25.8 Другие нарушения, обусловленные дисфункцией почечных канальцев ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-нефролог, врач – травматолог-ортопед, врач-офтальмолог, врач-эндокринолог – 2 раза в год. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. ОАК – 4 раза в год. ОАМ – 4 раза в год. Суточная экскреция K, Na, Са, Р, Cl – 1 раз в год. Суточная протеинурия – 1 раз в год. БАК (мочевина, креатинин, общий белок, ОХ, K, Na, Са, Р, Cl, ЩФ, глюкоза) – 1 раз в месяц до нормализации показателей, далее – 2 раза в год. Клиренс по эндогенному креатинину – 1 раз в месяц до нормализации показателей, далее – 2 раза в год. Исследование показателей КЩС – 4 раза в год. Уровень ПТГ – 1 раз в год. Денситометрия – 1 раз в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N27.0,__N27.1,__N27.9',
     'Наименование заболевания': 'N27.0, N27.1, N27.9 Маленькая почка по неизвестной причине ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-нефролог, врач-уролог – 1 раз в год (при отсутствии – консультация областного (городского) специалиста – по медицинским показаниям). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз год. ОАК – 1 раз в год. ОАМ – 2 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – 1 раз в год. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. БАК (мочевина, креатинин, общий белок, СРБ, K, Na, Са, Р, Cl) – 1 раз в год. Клиренс по эндогенному креатинину – 1 раз в год. Профиль АД – 4 раза в год. УЗИ почек – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N39.0',
     'Наименование заболевания': 'N39.0 Инфекция мочевыводящих путей без установленной локализации (более 3 рецидивов в год) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-нефролог – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – по медицинским показаниям). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач-уролог, врач – акушер-гинеколог – по медицинским показаниям. ОАК – 1 раз в год. ОАМ – 4 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – по медицинским показаниям. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. БАК (мочевина, креатинин, общий белок (К, Na, Са, Р, Cl, СРБ, глюкоза) – 1 раз в год. Вагинальный мазок на флору и ИППП – при рецидивах более 3 раз в год. УЗИ почек, мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при условии полной клинико-лабораторной ремиссии в течение 1 года '},

    {'mkb_key': 'N39.2',
     'Наименование заболевания': 'N39.2 Ортостатическая протеинурия неуточненная ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-нефролог – 1 раз в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – по медицинским показаниям). Врач-оториноларинголог – 1 раз в год. Врач-стоматолог детский (врач-стоматолог) – 1 раз в год. Врач-офтальмолог – по медицинским показаниям. ОАК – 1 раз в год. ОАМ – 2 раза в год. БАК (мочевина, креатинин, общий белок, K, Na, Са, Р, Cl) – 1 раз в год. Ортостатическая проба – 2 раза в год. Анализ мочи по Зимницкому с определением суточной протеинурии – 2 раза в год. УЗИ почек с определением подвижности – 1 раз в год. УЗИ мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета – при отсутствии протеинурии в течение 1 года '},

    {'mkb_key': 'Q61.1__Q61.2__Q61.3',
     'Наименование заболевания': 'Q61.1–Q61.3 Кистозная болезнь почек ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-нефролог – 2 раза в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог – 1 раз в год. Врач-уролог – по медицинским показаниям. ОАК – 2 раза в год. ОАМ – 2 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – 1 раз в год. Анализ мочи по Зимницкому – 2 раза в год. БАК (мочевина, креатинин, общий белок, билирубин, АЛТ, тимоловая проба, K, Na, Са, Р, Cl, СРБ) – 2 раза в год. Клиренс по эндогенному креатинину – 2 раза в год. Профиль АД – 4 раза в год. УЗИ ОБП, почек – 2 раза в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N30.1',
     'Наименование заболевания': 'N30.1 Интерстициальный цистит (хронический) ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 4 раза в год. Врач-нефролог – 2 раза в год (при отсутствии врача-нефролога – консультация областного (городского) врача-нефролога – 1 раз в год). Врач-уролог – по показаниям. Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог, врач – акушер-гинеколог – 1 раз в год. ОАК – 1 раз в год. ОАМ – 4 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам – 1 раз в год. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. БАК (мочевина, креатинин, общий белок, K, Na, Са, Р, Cl), СРБ, глюкоза – 1 раз в год. Мазок из влагалища на флору и ИППП (при рецидивах более 3 раз в год). УЗИ почек, мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'N20.0',
     'Наименование заболевания': 'N20.0 Камни почек ',
     'Сроки и кратность медицинских обследований': 'Врач-педиатр участковый (врач-педиатр, врач общей практики) – 2 раза в год. Врач-нефролог/врач-уролог – 2 раза в год (при отсутствии – консультация областного (городского) специалиста – 1 раз в год). Врач-оториноларинголог, врач-стоматолог детский (врач-стоматолог), врач-офтальмолог, врач – акушер-гинеколог – 1 раз в год. ОАК – 1 раз в год. ОАМ – 2 раза в год, далее – 2 раза в год. Бактериологическое исследование мочи с определением чувствительности к антибиотикам по медицинским показаниям – 1 раз в год. Бактериологическое исследование мочи на микобактерии туберкулеза – 1 раз в год. БАК (мочевина, креатинин, общий белок, K, Na, Са, Р, Cl, СРБ, глюкоза) – 1 раз в год. Суточная экскреция K, Na, Са, Р, Cl с мочой – 1 раз в год. УЗИ почек, мочевого пузыря – 1 раз в год ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'D16.0__D16.1__D16.2__D16.3__D16.7__D16.8__D16.9',
     'Наименование заболевания': 'D16.0–D16.3, D16.7–D16.9 Доброкачественное новообразование костей и суставных хрящей ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи; другие врачи-специалисты – по медицинским показаниям. Неоперированные: R-графия зоны поражения – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M16.0__M16.1__M16.2__M16.3__M16.4__M16.5__M16.6__M16.7__M16.8__M16.9__M17.0__M17.1__M17.2__M17.3__M17.4__M17.5__M17.6__M17.7__M17.8__M17.9__M18.0__M18.1__M18.2__M18.3__M18.4__M18.5__M18.6__M18.7__M18.8__M18.9__M19.0__M19.1__M19.2__M19.3__M19.4__M19.5__M19.6__M19.7__M19.8__M19.9__M20.0__M20.1__M20.2__M20.3__M20.4__M20.5__M20.6__M20.7__M20.8__M20.9__M21.0__M21.1__M21.2__M21.3__M21.4__M21.5__M21.6__M21.7__M21.8__M21.9__M22.0__M22.1__M22.2__M22.3__M22.4__M22.5__M22.6__M22.7__M22.8__M22.9__M23.0__M23.1__M23.2__M23.3__M23.4__M23.5__M23.6__M23.7__M23.8__M23.9__M24.0__M24.1__M24.2__M24.3__M24.4__M24.5__M24.6__M24.7__M24.8__M24.9__M25.0__M25.1__M25.2__M25.3__M25.4__M25.5__M25.6__M25.7__M25.8__M25.9',
     'Наименование заболевания': 'M16–М25 Артропатии ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M41.0__M41.1__M41.2__M41.3__M41.4__M41.5__M41.6__M41.7__M41.8__M41.9',
     'Наименование заболевания': 'M41 Сколиоз ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: при деформациях позвоночника I и II степени тяжести с патологической дугой менее 20° – врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; другие врачи-специалисты – по медицинским показаниям; при деформациях позвоночника II степени тяжести с патологической дугой 20° и более, III и IV степени тяжести – медицинский осмотр 3 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи; другие врачи-специалисты – по медицинским показаниям. Неоперированные: R-графия позвоночника в положении стоя – две проекции (прямая и боковая) после предварительного клинического осмотра врача-специалиста. Пациентам, которым показано корсетное корригирующее лечение, – соответствующее рентгенологическое обследование. МРТ и другие методы обследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M40.0__M40.1__M40.2__M40.3__M40.4__M40.5__M40.6__M40.7__M40.8__M40.9__M42.0',
     'Наименование заболевания': 'M40 (М40.0–М40.5) Кифоз и лордоз М42.0 Юношеский остеохондроз позвоночника ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: при деформациях позвоночника I степени тяжести – врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; другие врачи-специалисты – по медицинским показаниям; при деформациях позвоночника II–IV степени тяжести – осмотр 3 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия позвоночника в положении стоя – две проекции (прямая и боковая) после предварительного клинического осмотра врача-специалиста. Пациентам, которым показано корсетное корригирующее лечение, проводится соответствующее рентгенологическое обследование. МРТ и другие методы обследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q67.5__Q76.1__Q76.2__Q76.3__Q76.4__Q76.5__Q76.6',
     'Наименование заболевания': 'Q67.5 Врожденные деформации позвоночника, деформации позвоночника на почве врожденных аномалий развития Q76.1–Q76.6 Врожденные аномалии (пороки развития) позвоночника и костей грудной клетки ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: при деформациях позвоночника I степени тяжести – врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; при деформациях позвоночника II–IV степени тяжести – медицинский осмотр 3 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия позвоночника в положении стоя – две проекции (прямая и боковая) после предварительного клинического осмотра врача-специалиста. Пациентам, которым показано корсетное корригирующее лечение, проводится соответствующее рентгенологическое обследование. МРТ и другие методы обследования – по медицинским показаниям. Оперированные: объем и кратность обследования и наблюдения после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M43.0__M43.1__M43.2__M43.3__M43.4__M43.5__M43.6__M43.7__M43.8__M43.9__M45.0__M45.1__M45.2__M45.3__M45.4__M45.5__M45.6__M45.7__M45.8__M45.9__M46.0__M46.1__M46.2__M46.3__M46.4__M46.5__M46.6__M46.7__M46.8__M46.9__M47.0__M47.1__M47.2__M47.3__M47.4__M47.5__M47.6__M47.7__M47.8__M47.9__M48.0__M48.1__M48.2__M48.3__M48.4__M48.5__M48.6__M48.7__M48.8__M48.9',
     'Наименование заболевания': 'M43 Другие деформирующие дорсопатии М45–М48 Спондилопатия ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования и наблюдения после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M61.0__M61.1__M61.2__M61.3__M61.4__M61.5__M61.6__M61.7__M61.8__M61.9__M62.0__M62.1__M62.2__M62.3__M62.4__M62.6__M62.7__M62.8__M62.9',
     'Наименование заболевания': 'M61 Кальцификация и оссификация мышцы М62.0–М62.4, М62.6–М62.9 Другие поражения мышцы ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: электрофизиологическое обследование (электромиография) – 1 раз в год; другие обследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M65.2__M65.3__M65.4__M66.0__M66.1__M66.2__M66.3__M66.4__M66.5__M66.6__M66.7__M66.8__M66.9__M67.0__M67.1__M67.2',
     'Наименование заболевания': 'M65.2–M65.4 Синовиты и теносиновиты М66 Спонтанный разрыв синовиальной оболочки и сухожилия М67.0–М67.2 Другие поражения синовиальных оболочек и сухожилий ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия сустава – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования до и после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'M70.0__M75.1__M75.2__M75.3',
     'Наименование заболевания': 'M70.0 Хронический крепитирующий синовит кисти и запястья М75.1–М75.3 Поражения плеча ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – 2 раза в год, другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q65.0__Q65.1__Q65.2__Q65.3__Q65.4__Q65.5__Q65.6__Q65.7__Q65.8__Q65.9',
     'Наименование заболевания': 'Q65 Врожденные деформации бедра ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – в возрасте 1, 3, 6 и 12 месяцев; далее – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. УЗИ тазобедренных суставов в 3 и 6 месяцев. R-графия тазобедренных суставов, другие обследования – по медицинским показаниям. Оперированные: объем и кратность обследования и наблюдения после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q66.0__Q66.1__Q66.2__Q66.3__Q66.4__Q66.5__Q66.6__Q66.7__Q66.8__Q66.9__Q67.5__Q67.6__Q67.7__Q67.8__Q68.0__Q68.1__Q68.2__Q68.3__Q68.4__Q68.5__Q68.6__Q68.7__Q68.8__Q68.9',
     'Наименование заболевания': 'Q66 Врожденные деформации стопы Q67.5–Q67.8 Врожденные костно-мышечные деформации головы, лица, позвоночника и грудной клетки Q68 Другие врожденные костно-мышечные деформации ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – в возрасте 1, 3, 6 и 12 месяцев; далее – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования до и после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q69.0__Q69.1__Q69.2__Q69.3__Q69.4__Q69.5__Q69.6__Q69.7__Q69.8__Q69.9__Q70.0__Q70.1__Q70.2__Q70.3__Q70.4__Q70.5__Q70.6__Q70.7__Q70.8__Q70.9',
     'Наименование заболевания': 'Q69 Полидактилия Q70 Синдактилия ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – в возрасте 1, 3, 6 и 12 месяцев, далее – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения, другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет '},

    {'mkb_key': 'Q71.0__Q71.1__Q71.2__Q71.3__Q71.4__Q71.5__Q71.6__Q71.7__Q71.8__Q71.9__Q72.0__Q72.1__Q72.2__Q72.3__Q72.4__Q72.5__Q72.6__Q72.7__Q72.8__Q72.9__Q73.0__Q73.1__Q73.2__Q73.3__Q73.4__Q73.5__Q73.6__Q73.7__Q73.8__Q73.9__Q74.0__Q74.1__Q74.2__Q74.3__Q74.4__Q74.5__Q74.6__Q74.7__Q74.8__Q74.9__Q77.0__Q77.1__Q77.2__Q77.3__Q77.4__Q77.5__Q77.6__Q77.7__Q77.8__Q77.9__Q78.0__Q78.1__Q78.2__Q78.3__Q78.4__Q78.5__Q78.6__Q78.7__Q78.8__Q78.9__Q79.6,__Q79.8,__Q79.9',
     'Наименование заболевания': 'Q71 Дефекты, укорачивающие верхнюю конечность Q72 Дефекты, укорачивающие нижнюю конечность Q73 Дефекты, укорачивающие конечность неуточненную Q74 Другие врожденные аномалии (пороки развития) конечности(ей) Q77 Остеохондродисплазия с дефектами роста трубчатых костей и позвоночника Q78 Другие остеохондродисплазии Q79.6, Q79.8, Q79.9 Врожденные аномалии (пороки развития) костно-мышечной системы, не классифицированные в других рубриках ',
     'Сроки и кратность медицинских обследований': 'Неоперированные: врач – травматолог-ортопед (врач – детский хирург, врач-хирург) – в возрасте 1, 3, 6 и 12 месяцев; далее – 1 раз в год; другие врачи-специалисты – по медицинским показаниям. Оперированные: наблюдение пациентов после хирургического лечения осуществляется согласно рекомендациям врача-специалиста организации здравоохранения, где оказывался данный вид медицинской помощи. Неоперированные: R-графия зоны поражения – 1 раз в год; другие исследования – по медицинским показаниям. Оперированные: объем и кратность обследования и наблюдения после хирургического лечения определяются врачом-специалистом организации здравоохранения, где оказывался данный вид медицинской помощи ',
     'Сроки наблюдения за пациентом': 'Снятие с учета по достижении 18 лет   '}
)
