s_k_l = {
    'Болезни органов дыхания': {
        "name": "Санатории (отделения) пульмонологического профиля",
        "contraindications": "Все заболевания бронхолегочной системы в остром периоде. \nДыхательная, легочно-сердечная недостаточность выше I степени",
        "indications": "J12 - J18 Острая пневмония осложненная, затяжная - более 6 недель;\n"
                       "J32 Хронические синуситы;\n"
                       "J35 Хронические болезни миндалин и аденоидов;\n"
                       "J37 Хронический ларингит, хронический ларинготрахеит, аллергический ларинготрахеит вне периода обострения;\n "
                       "J41, J42 Рецидивирующий бронхит (с частотой 3 и более раза в году);\n"
                       "J44 Хронический бронхит, хронический обструктивный бронхит - в стадии ремиссии;\n"
                       "J45 Бронхиальная астма легкой, средней, тяжелой степени в период ремиссии;\n"
                       "J47 Бронхоэктатическая болезнь, не ранее 3 месяцев от наступления ремиссии;\n"
                       "J85 J86 J90 - J94 Состояние после оперативного лечения по поводу хронических неспецифических заболеваний легких, "
                       "не ранее 6 месяцев после оперативного лечения и при отсутствии послеоперационных осложнений;\n"
                       "J98  Другие респираторные нарушения. Часто и длительно болеющие респираторными заболеваниями - в стадии ремиссии, состоящие на диспансерном учете;\n"
                       "Q32, Q33  Врожденные аномалии (пороки развития) трахеи, бронхов, легкого;\n"
                       "E84, Q89.3  Наследственные и системные заболевания бронхолегочной системы \n(муковисцидоз, синдром Картагенера, иммунодефицитные состояния и др.) вне обострения воспалительного процесса",
    },
    'Болезни органов пищеварения': {
        "name": "Санатории (отделения) гастроэнтерологического профиля",
        "contraindications": "Все болезни органов пищеварения в период обострения. Органический стеноз привратника.\n "
                             "Цирроз печени при варикозе вен пищевода, печеночная недостаточность. Аутоиммунный гепатит",
        "indications": "K20 K21  Эзофагит, гастроэзофагеальный рефлюкс;\n"
                       "K25 - K28  Язва желудка и язва двенадцатиперстной кишки, не осложненные формы, не ранее 3 месяцев после обострения;\n"
                       "B18 B94.2  Хронический гепатит В, С в период ремиссии с минимальной степенью активности;\n"
                       "K81.1  Хронический холецистит, не ранее 3 месяцев после обострения;\n"
                       "K86.1 - K86.2 K87.1 B25.2 B26.3  Хронический панкреатит в период ремиссии;\n"
                       "K29  Хронический гастрит и дуоденит в стадии полной клинической ремиссии;\n"
                       "K52.9  Хронический колит, энтерит в период ремиссии;\n"
                       "B15, B16  Острый гепатит A, B - не ранее 3 месяцев после выписки, при отсутствии активности процесса;\n"
                       "B18, K73  Хронический гепатит неклассифицированный с минимальной степенью активности и вне обострения;\n",
    },
    'Болезни нервной системы, костно-мышечной системы и соединительной ткани': {
        "name": "Санатории (отделения) неврологического, ортопедотравматологического профиля",
        "contraindications": "Тяжелая степень обездвиженности, тяжелые расстройства тонуса, тяжелые гиперкинезы, мозжечковые расстройства, \n"
                             "расстройства личности и поведения в стадии декомпенсации, глубокие нарушения функций тазовых органов, тяжелая и глубокая умственная отсталость. \n"
                             "Частые судорожные припадки, не контролируемые лекарственными средствами. Болезни нервной системы в остром периоде. \n"
                             "Все формы прогрессирующих мышечных дистрофий с развернутыми клиническими формами. Прогрессирующая гидроцефалия. \n"
                             "Системные заболевания скелета, ограничивающие самообслуживание и самостоятельное передвижение пациента. \n"
                             "Остеомиелит в стадии обострения, при наличии множественных, распространенных свищей, больших секвестров ",
        "indications": "G09  Последствия воспалительных заболеваний центральной нервной системы. Арахноидиты, лептоменингиты головного мозга в стадии ремиссии - не ранее 3 месяцев от начала заболевания;\n"
                       "G80  Детский церебральный паралич и другие паралитические синдромы с двигательными нарушениями различной степени тяжести "
                       "с контрактурами суставов, другими изменениями опорно-двигательного аппарата, требующими ортопедической коррекции, "
                       "с легкой и умеренной интеллектуальной недостаточностью, специфическими расстройствами психологического развития, речи и языка, редкими эпилептическими припадками;\n"
                       "G12  Спинальная мышечная атрофия с двигательными нарушениями. Спинальная мышечная атрофия Кугельбарга - Веландера;\n"
                       "G71- G72  Наследственные прогрессирующие мышечные дистрофии и врожденные миопатии с двигательными нарушениями (миопатия Эрба, Ландузи - Дежерина и др.);\n"
                       "G54  Полиневропатии и другие поражения периферической нервной системы."
                       "G56 - G58 Мононевропатии конечностей, другие, после окончания острого периода, в восстановительном периоде;\n"
                       "G60  Наследственная и идиопатическая невропатия, болезнь Шарко - Мари;\n"
                       "Q65 - Q79, M20 - M25  Врожденные и приобретенные деформации опорно-двигательного аппарата с двигательными нарушениями;\n"
                       "M08  Ювенальный ревматоидный артрит суставно-висцеральная форма с активностью I степени, суставная форма II степени, с двигательными нарушениями - не ранее 1,5 месяца после окончания гормонотерапии;\n"
                       "Q74.3  Артрогрипоз с двигательными нарушениями;\n"
                       "Q77.7   Хондродистрофия с двигательными нарушениями;\n"
                       "M86 3 Остеомиелит - не ранее 6 месяцев после окончания острой стадии при отсутствии свищей и не требующий оперативного лечения;\n"
                       "S14, S24, S34, S44, S54, S64, S74, S84, S94   Последствия травм корешков, сплетений, нервных стволов, не требующие хирургического вмешательства, с двигательными, чувствительными нарушениями, болевым синдромом, признаками восстановления функций, без каузалгий, сосудистых и трофических нарушений, фантомных болей - не ранее 2 месяцев после операции;\n"
                       "T95   Последствия термических и химических ожогов и отморожений, состояния после восстановительных оперативных вмешательств на сухожилиях, пластики, контрактуры (для разработки двигательных нарушений);\n"
                       "M41   Сколиозы I - III степени",
    },
    'Болезни мочеполовой системы': {
        "name": "Санатории (отделения) неврологического, ортопедотравматологического профиля",
        "contraindications": "Болезни мочеполовой системы Высокая активность патологического процесса в органах мочевой системы. "
                             "Хроническая почечная недостаточность в стадии декомпенсации. Нарушения уродинамики, требующие хирургической коррекции. "
                             "Неконтролируемая артериальная гипертензия",
        "indications": "N03  Хронический нефритический синдром. Хронический гломерулонефрит, гематурическая форма IgA - нефропатия (болезнь Берже), стадия частичной или полной клинико-лабораторной ремиссии. Наследственный нефрит в стадии субкомпенсации или компенсации;\n"
                       "N03  Нефротический синдром. Хронический гломерулонефрит, нефротическая форма в стадии частичной или полной клинико-лабораторной ремиссии;\n"
                       "N10  Острый тубулоинтерстициальный нефрит. Острый интерстициальный нефрит, острый пиелонефрит в стадии частичной или полной клинико-лабораторной ремиссии;\n"
                       "N11  Хронический тубулоинтерстициальный нефрит. Необструктивный хронический пиелонефрит без нарушения уродинамики в стадии частичной или полной клинико-лабораторной ремиссии, после оперативной коррекции;\n"
                       "N20  Камни почки и мочеточника. Мочекаменная болезнь (уролитиаз) в стадии частичной или полной клинико-лабораторной ремиссии пиелонефрита - через 6 месяцев после оперативного лечения;\n"
                       "N25  Нарушения, развивающиеся в результате дисфункции почечных канальцев. Первичные и вторичные тубулопатии при отсутствии существенных нарушений опорно-двигательного аппарата в стадии субкомпенсации или компенсации при нарушении парциальных функций почек;\n"
                       "N18  Хроническая почечная недостаточность в стадии компенсации или субкомпенсации;\n"
                       "Q60 - Q64  Врожденные аномалии мочевой системы, в том числе после хирургической коррекции (через 6 месяцев), при наличии хронического микробно-воспалительного процесса, в стадии частичной клинико-лабораторной ремиссии, латентного течения;\n"
                       "N70.1  Хронический сальпингит, оофорит, сальпингоофорит, период ремиссии при: неизмененной функции яичников, наличии гипоэстрогении, наличии гиперэстрогении;\n Болезни женских половых органов в остром периоде. Ювенальные маточные кровотечения при заболеваниях свертывающей системы крови. Преждевременное половое созревание. Кисты и кистомы яичников. Миома матки, эндометриоз, требующие оперативного лечения Санатории (отделения) гинекологического профиля"
                       "N91.0   Первичная аменорея, обусловленная функциональными нарушениями гипоталамо-гипофизарных структур, после исключения органической патологии;\n"
                       "N91.1   Вторичная аменорея, обусловленная функциональными нарушениями гипоталамо-гипофизарных структур;\n"
                       "N91.4   Вторичная олигоменорея. Олигоменорея, обусловленная функциональными нарушениями гипоталамо-гипофизарных структур;\n"
                       "N30   Хронический цистит, тригонит в стадии полной клинико-лабораторной ремиссии.",
    },
    'Болезни системы кровообращения': {
        "name": "Санатории (отделения) кардиологического профиля",
        "contraindications": "Ревматизм при наличии активности процесса. Недостаточность кровообращения от IIБ степени и выше. "
                             "Дыхательная, легочно-сердечная недостаточность выше I степени. Мерцательная аритмия, пароксизмальная тахикардия с частыми приступами. "
                             "Полная атриовентрикулярная блокада при частоте сердечных сокращений менее 50 в 1 минуту, наличии приступов Морганьи - Эдемса - Стокса. Неконтролируемая артериальная гипертензия",
        "indications": "I00 - I08  Ревматизм в неактивной фазе - не ранее 6 месяцев после окончания атаки, рецидива;\n"
                       "Q20 - Q24  Врожденные аномалии (пороки развития) сердечных камер соединений, сердечной перегородки, сердечных клапанов, другие врожденные аномалии "
                       "(пороки развития) сердца - до и не ранее 6 месяцев после оперативного лечения (исключая снятых с диспансерного учета);\n"
                       "I34 - I37  Неревматические поражения клапанов сердца, после оперативного лечения не ранее 6 месяцев. Состояния после оперативного лечения на сердце и сосудах - не ранее 6 месяцев после операции;\n"
                       "I33 - I40  Острый кардит при отсутствии клинических проявлений - не ранее 6 месяцев от начала заболевания;\n"
                       "I10  Эссенциальная (первичная) гипертензия. Первичная артериальная гипертензия IA, Б стадий;\n"
                       "I95  Первичная артериальная гипотензия без синкопальных приступов;\n"
                       "F45.3  Соматофорная дисфункция вегетативной нервной системы. Вегетососудистая дистония по гипер- и гипотоническому типу",
    },
    'Болезни эндокринной системы, нарушения обмена веществ': {
        "name": "Санатории с отделениями эндокринологического профиля либо гастроэнтерологического профиля (при условии наличия в штате врача-эндокринолога)",
        "contraindications": "Сахарный диабет в состоянии декомпенсации. Некомпенсированное нарушение функции щитовидной железы.Гиперфункция щитовидной железы - для южных курортов в летний период (июнь - август)",
        "indications": "E03  Гипотиреоз любой этиологии после подбора дозы L-тироксина, в эутиреоидном состоянии;\n"
                       "E06  Тиреоидит аутоиммунный, лимфоцитарный тиреоидит (зоб Хасимото), эутиреоидный после подбора лечения;\n"
                       "E10, E11  Болезни щитовидной железы, связанные с йодной недостаточностью, и сходные состояния. Эндемический зоб (узловой, диффузный, смешанный) без нарушения функции щитовидной железы\n"
                       "E01  Тиреоидит аутоиммунный, лимфоцитарный тиреоидит (зоб Хасимото), эутиреоидный после подбора лечения;\n",
    },
    'Болезни кожи и подкожной клетчатки': {
        "name": "Местные санатории (отделения) и санатории на бальнеогрязевых курортах (Сочи - Мацеста) и др.",
        "contraindications": "Болезни кожи в острой стадии. Все заболевания кожи, не указанные в показаниях. Все заразные заболевания кожи. "
                             "Псориаз в прогрессирующей стадии. Необратимые суставные, костно-суставные и сухожильные изменения опорно-двигательного аппарата, вызванные тяжелой ожоговой травмой. "
                             "Длительно незаживающие ожоговые раны, требующие оперативного лечения",
        "indications": "L20 Атопический дерматит распространенный, экзема детская, нейродермит (диффузный);\n"
                       "L40  Псориаз (зимняя форма - направляются в бальнеогрязевой курорт в летнее время)."
                       "M07 Псориатические артропатии;\n"
                       "L94  Склеродермия;\n"
                       "L85  Ихтиоз, кератоз (кератодермия), кроме грибковых поражений (направляются в бальнеогрязевой курорт в летнее время);\n"
                       "T95  Дерматогенные, миогенные, артрогенные контрактуры обратимого характера, возникшие после перенесенных ожогов с восстановленным кожным покровом, "
                       "келоидные и гипертрофические рубцы, развившиеся на месте ожоговых ран. "
                       "Состояния после реконструктивно-восстановительных операций, произведенных по поводу контрактур и рубцовых стяжений. "
                       "Перенесенные обширные поверхностные и глубокие ожоги с восстановленным кожным покровом",
    },
    'Болезни глаза и его придаточного аппарата': {
        "name": "Санатории с отделениями офтальмологического профиля;\n санатории, имеющие в своем составе офтальмологический кабинет",
        "contraindications": "",
        "indications": "H52, H44 Миопия любой степени быстропрогрессирующая более 1 диоптрии в год;\n"
                       "H35  Ретинопатия недоношенных - стадия регресса, рубцовая стадия;\n"
                       "H50  Содружественное сходящееся косоглазие;\n"
                       "H50  Содружественное расходящееся косоглазие;\n"
                       "H50  Паралитическое сходящееся или расходящееся косоглазие;\n"
                       "H53  Аблиопия;\n"
                       "H52  Гиперметропия средней и высокой степени;\n"
                       "H31  Дистрофические изменения сетчатки глаза;\n"
                       "H47  Частичная атрофия дисков зрительного нерва;\n"
                       "H50, H25, H40, S05, H33   Состояние после перенесенного оперативного вмешательства по поводу косоглазия, катаракты, глаукомы, травм глаза, отслойки сетчатки;\n"
                       "H16, H20, H3, H15, H19   Состояние после перенесенного кератита, увеита, ретинита, склерита",
    }

}

